#pragma once

// Name: Fortnite, Version: OT-6_5


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum FortniteGame.EFortAIDirectorEvent
enum class FortniteGame_EFortAIDirectorEvent : uint8_t
{
	EFortAIDirectorEvent__PlayerAIEnemies = 0,
	EFortAIDirectorEvent__PlayerTakeDamage = 1,
	EFortAIDirectorEvent__PlayerHealth = 2,
	EFortAIDirectorEvent__PlayerDeath = 3,
	EFortAIDirectorEvent__PlayerLookAtAIEnemy = 4,
	EFortAIDirectorEvent__PlayerDamageAIEnemy = 5,
	EFortAIDirectorEvent__PlayerKillAIEnemy = 6,
	EFortAIDirectorEvent__PlayerHealingPotential = 7,
	EFortAIDirectorEvent__PlayerAmmoLight = 8,
	EFortAIDirectorEvent__PlayerAmmoMedium = 9,
	EFortAIDirectorEvent__PlayerAmmoHeavy = 10,
	EFortAIDirectorEvent__PlayerAmmoShells = 11,
	EFortAIDirectorEvent__PlayerAmmoEnergy = 12,
	EFortAIDirectorEvent__PlayerAINear = 13,
	EFortAIDirectorEvent__PlayerMovement = 14,
	EFortAIDirectorEvent__ObjectiveTakeDamage = 15,
	EFortAIDirectorEvent__ObjectiveHealth = 16,
	EFortAIDirectorEvent__ObjectiveDestroyed = 17,
	EFortAIDirectorEvent__TrapFired = 18,
	EFortAIDirectorEvent__TrapDamagedAIEnemy = 19,
	EFortAIDirectorEvent__ObjectivePathCost = 20,
	EFortAIDirectorEvent__PlayerPathCost = 21,
	EFortAIDirectorEvent__ObjectiveNearbyBuildingDamaged = 22,
	EFortAIDirectorEvent__Max_None = 23,
	EFortAIDirectorEvent__EFortAIDirectorEvent_MAX = 24,

};

// Enum FortniteGame.EKeepDefenseState
enum class FortniteGame_EKeepDefenseState : uint8_t
{
	EKeepDefenseState__Inactive    = 0,
	EKeepDefenseState__Warmup      = 1,
	EKeepDefenseState__Defense     = 2,
	EKeepDefenseState__LastAlive   = 3,
	EKeepDefenseState__Max         = 4,
	EKeepDefenseState__EKeepDefenseState_MAX = 5,

};

// Enum FortniteGame.ECaptureState
enum class FortniteGame_ECaptureState : uint8_t
{
	ECaptureState__CS_Idle         = 0,
	ECaptureState__CS_Capturing    = 1,
	ECaptureState__CS_Contested    = 2,
	ECaptureState__CS_Resetting    = 3,
	ECaptureState__CS_Captured     = 4,
	ECaptureState__CS_Reset        = 5,
	ECaptureState__CS_MAX          = 6,

};

// Enum FortniteGame.EFortTeam
enum class FortniteGame_EFortTeam : uint8_t
{
	EFortTeam__HumanCampaign       = 0,
	EFortTeam__Monster             = 1,
	EFortTeam__HumanPvP_Team1      = 2,
	EFortTeam__HumanPvP_Team2      = 3,
	EFortTeam__HumanPvP_Team3      = 4,
	EFortTeam__HumanPvP_Team4      = 5,
	EFortTeam__HumanPvP_Team5      = 6,
	EFortTeam__HumanPvP_Team6      = 7,
	EFortTeam__HumanPvP_Team7      = 8,
	EFortTeam__HumanPvP_Team8      = 9,
	EFortTeam__HumanPvP_Team9      = 10,
	EFortTeam__HumanPvP_Team10     = 11,
	EFortTeam__Spectator           = 12,
	EFortTeam__MAX                 = 13,
	EFortTeam__EFortTeam_MAX       = 14,

};

// Enum FortniteGame.EFortCustomPartType
enum class FortniteGame_EFortCustomPartType : uint8_t
{
	EFortCustomPartType__Head      = 0,
	EFortCustomPartType__Body      = 1,
	EFortCustomPartType__Hat       = 2,
	EFortCustomPartType__Backpack  = 3,
	EFortCustomPartType__Charm     = 4,
	EFortCustomPartType__Face      = 5,
	EFortCustomPartType__NumTypes  = 6,
	EFortCustomPartType__EFortCustomPartType_MAX = 7,

};

// Enum FortniteGame.EFortDayPhase
enum class FortniteGame_EFortDayPhase : uint8_t
{
	EFortDayPhase__Morning         = 0,
	EFortDayPhase__Day             = 1,
	EFortDayPhase__Evening         = 2,
	EFortDayPhase__Night           = 3,
	EFortDayPhase__NumPhases       = 4,
	EFortDayPhase__EFortDayPhase_MAX = 5,

};

// Enum FortniteGame.EFortPersistentResources
enum class FortniteGame_EFortPersistentResources : uint8_t
{
	EFortPersistentResources__Power = 0,
	EFortPersistentResources__ManufacturingParts = 1,
	EFortPersistentResources__Supplies = 2,
	EFortPersistentResources__Food = 3,
	EFortPersistentResources__Max_None = 4,
	EFortPersistentResources__EFortPersistentResources_MAX = 5,

};

// Enum FortniteGame.EFortAttributeDisplay
enum class FortniteGame_EFortAttributeDisplay : uint8_t
{
	EFortAttributeDisplay__BasicInt = 0,
	EFortAttributeDisplay__NegativeImpliesInfiniteInt = 1,
	EFortAttributeDisplay__BasicFloat = 2,
	EFortAttributeDisplay__NegativeImpliesInfiniteFloat = 3,
	EFortAttributeDisplay__BasicString = 4,
	EFortAttributeDisplay__NormalizedPercentage = 5,
	EFortAttributeDisplay__StringArray = 6,
	EFortAttributeDisplay__SlateBrush = 7,
	EFortAttributeDisplay__DoNotDisplay = 8,
	EFortAttributeDisplay__None_Max = 9,
	EFortAttributeDisplay__EFortAttributeDisplay_MAX = 10,

};

// Enum FortniteGame.EFortBrushSize
enum class FortniteGame_EFortBrushSize : uint8_t
{
	EFortBrushSize__VeryVerySmall  = 0,
	EFortBrushSize__VerySmall      = 1,
	EFortBrushSize__Small          = 2,
	EFortBrushSize__Medium         = 3,
	EFortBrushSize__Large          = 4,
	EFortBrushSize__VeryLarge      = 5,
	EFortBrushSize__EFortBrushSize_MAX = 6,

};

// Enum FortniteGame.EMyTownBuildingState
enum class FortniteGame_EMyTownBuildingState : uint8_t
{
	EMyTownBuildingState__Locked   = 0,
	EMyTownBuildingState__CanBuild = 1,
	EMyTownBuildingState__CanUpgrade = 2,
	EMyTownBuildingState__Idle     = 3,
	EMyTownBuildingState__EMyTownBuildingState_MAX = 4,

};

// Enum FortniteGame.EMatchmakingCompleteResult
enum class FortniteGame_EMatchmakingCompleteResult : uint8_t
{
	EMatchmakingCompleteResult__NotStarted = 0,
	EMatchmakingCompleteResult__Cancelled = 1,
	EMatchmakingCompleteResult__NoResults = 2,
	EMatchmakingCompleteResult__Failure = 3,
	EMatchmakingCompleteResult__CreateFailure = 4,
	EMatchmakingCompleteResult__Success = 5,
	EMatchmakingCompleteResult__EMatchmakingCompleteResult_MAX = 6,

};

// Enum FortniteGame.EMatchmakingState
enum class FortniteGame_EMatchmakingState : uint8_t
{
	EMatchmakingState__NotMatchmaking = 0,
	EMatchmakingState__CancelingMatchmaking = 1,
	EMatchmakingState__ReleasingLock = 2,
	EMatchmakingState__AcquiringLock = 3,
	EMatchmakingState__LockAcquistionFailure = 4,
	EMatchmakingState__FindingEmptyServer = 5,
	EMatchmakingState__FindingExistingSession = 6,
	EMatchmakingState__TestingEmptyServers = 7,
	EMatchmakingState__TestingExistingSessions = 8,
	EMatchmakingState__JoiningExistingSession = 9,
	EMatchmakingState__NoMatchesAvailable = 10,
	EMatchmakingState__CleaningUpExisting = 11,
	EMatchmakingState__HandlingFailure = 12,
	EMatchmakingState__JoinSuccess = 13,
	EMatchmakingState__EMatchmakingState_MAX = 14,

};

// Enum FortniteGame.EFortPartyRestriction
enum class FortniteGame_EFortPartyRestriction : uint8_t
{
	EFortPartyRestriction__Invalid = 0,
	EFortPartyRestriction__PartyCreatePending = 1,
	EFortPartyRestriction__AlreadyInParty = 2,
	EFortPartyRestriction__PartyFull = 3,
	EFortPartyRestriction__GameFull = 4,
	EFortPartyRestriction__Private = 5,
	EFortPartyRestriction__CurrentlyNotAvailable = 6,
	EFortPartyRestriction__Max     = 7,
	EFortPartyRestriction__EFortPartyRestriction_MAX = 8,

};

// Enum FortniteGame.EFortFriendRequestStatus
enum class FortniteGame_EFortFriendRequestStatus : uint8_t
{
	EFortFriendRequestStatus__None = 0,
	EFortFriendRequestStatus__Accepted = 1,
	EFortFriendRequestStatus__PendingReceived = 2,
	EFortFriendRequestStatus__PendingSent = 3,
	EFortFriendRequestStatus__EFortFriendRequestStatus_MAX = 4,

};

// Enum FortniteGame.EFortPartyState
enum class FortniteGame_EFortPartyState : uint8_t
{
	EFortPartyState__WorldView     = 0,
	EFortPartyState__TheaterView   = 1,
	EFortPartyState__Matchmaking   = 2,
	EFortPartyState__PostMatchmaking = 3,
	EFortPartyState__EFortPartyState_MAX = 4,

};

// Enum FortniteGame.EFortPartyTransition
enum class FortniteGame_EFortPartyTransition : uint8_t
{
	EFortPartyTransition__Idle     = 0,
	EFortPartyTransition__Joining  = 1,
	EFortPartyTransition__Leaving  = 2,
	EFortPartyTransition__Max      = 3,
	EFortPartyTransition__EFortPartyTransition_MAX = 4,

};

// Enum FortniteGame.EFortQuestObjectiveType
enum class FortniteGame_EFortQuestObjectiveType : uint8_t
{
	EFortQuestObjectiveType__Kill  = 0,
	EFortQuestObjectiveType__Collect = 1,
	EFortQuestObjectiveType__Complete = 2,
	EFortQuestObjectiveType__Win   = 3,
	EFortQuestObjectiveType__LevelUp = 4,
	EFortQuestObjectiveType__Custom = 5,
	EFortQuestObjectiveType__Client = 6,
	EFortQuestObjectiveType__EFortQuestObjectiveType_MAX = 7,

};

// Enum FortniteGame.EAIHotSpotSlot
enum class FortniteGame_EAIHotSpotSlot : uint8_t
{
	EAIHotSpotSlot__Free           = 0,
	EAIHotSpotSlot__Claimed        = 1,
	EAIHotSpotSlot__Occupied       = 2,
	EAIHotSpotSlot__Blocked        = 3,
	EAIHotSpotSlot__Disabled       = 4,
	EAIHotSpotSlot__EAIHotSpotSlot_MAX = 5,

};

// Enum FortniteGame.EAIHotSpotAssignmentFilter
enum class FortniteGame_EAIHotSpotAssignmentFilter : uint8_t
{
	EAIHotSpotAssignmentFilter__All = 0,
	EAIHotSpotAssignmentFilter__WithSlots = 1,
	EAIHotSpotAssignmentFilter__WaitingList = 2,
	EAIHotSpotAssignmentFilter__EAIHotSpotAssignmentFilter_MAX = 3,

};

// Enum FortniteGame.EAIHotSpotSlotFilter
enum class FortniteGame_EAIHotSpotSlotFilter : uint8_t
{
	EAIHotSpotSlotFilter__All      = 0,
	EAIHotSpotSlotFilter__AvailableOnly = 1,
	EAIHotSpotSlotFilter__UnavailableOnly = 2,
	EAIHotSpotSlotFilter__EAIHotSpotSlotFilter_MAX = 3,

};

// Enum FortniteGame.EFortBangType
enum class FortniteGame_EFortBangType : uint8_t
{
	EFortBangType__Invalid         = 0,
	EFortBangType__Custom          = 1,
	EFortBangType__PlayTab         = 2,
	EFortBangType__HeroesTab       = 3,
	EFortBangType__VaultTab        = 4,
	EFortBangType__StoreTab        = 5,
	EFortBangType__FriendsButton   = 6,
	EFortBangType__PartyInviteButton = 7,
	EFortBangType__DailyRewardsButton = 8,
	EFortBangType__QuestsButton    = 9,
	EFortBangType__VaultSchematics = 10,
	EFortBangType__VaultPersonnel  = 11,
	EFortBangType__VaultResources  = 12,
	EFortBangType__VaultMelee      = 13,
	EFortBangType__VaultRanged     = 14,
	EFortBangType__VaultConsumables = 15,
	EFortBangType__VaultIngredients = 16,
	EFortBangType__VaultTraps      = 17,
	EFortBangType__EFortBangType_MAX = 18,

};

// Enum FortniteGame.EFortEventNameType
enum class FortniteGame_EFortEventNameType : uint8_t
{
	EFortEventNameType__Mission    = 0,
	EFortEventNameType__Client     = 1,
	EFortEventNameType__EFortEventNameType_MAX = 2,

};

// Enum FortniteGame.EFortCraftFailCause
enum class FortniteGame_EFortCraftFailCause : uint8_t
{
	EFortCraftFailCause__Unknown   = 0,
	EFortCraftFailCause__NotEnoughResources = 1,
	EFortCraftFailCause__InventoryFull = 2,
	EFortCraftFailCause__InsufficientTeamLevel = 3,
	EFortCraftFailCause__CraftingQueueFull = 4,
	EFortCraftFailCause__CurrentlyLocked = 5,
	EFortCraftFailCause__EFortCraftFailCause_MAX = 6,

};

// Enum FortniteGame.EKeepContainerType
enum class FortniteGame_EKeepContainerType : uint8_t
{
	EKeepContainerType__Base       = 0,
	EKeepContainerType__Storeroom  = 1,
	EKeepContainerType__FirstAid   = 2,
	EKeepContainerType__Armory     = 3,
	EKeepContainerType__Workshop   = 4,
	EKeepContainerType__AmmoStash  = 5,
	EKeepContainerType__Max        = 6,
	EKeepContainerType__EKeepContainerType_MAX = 7,

};

// Enum FortniteGame.EReadyCheckState
enum class FortniteGame_EReadyCheckState : uint8_t
{
	EReadyCheckState__CheckStarted = 0,
	EReadyCheckState__Ready        = 1,
	EReadyCheckState__NotReady     = 2,
	EReadyCheckState__EReadyCheckState_MAX = 3,

};

// Enum FortniteGame.ERichPresenceStateChange
enum class FortniteGame_ERichPresenceStateChange : uint8_t
{
	ERichPresenceStateChange__AutoUpdate = 0,
	ERichPresenceStateChange__Idle = 1,
	ERichPresenceStateChange__Active = 2,
	ERichPresenceStateChange__Busy = 3,
	ERichPresenceStateChange__NotBusy = 4,
	ERichPresenceStateChange__ERichPresenceStateChange_MAX = 5,

};

// Enum FortniteGame.EFortAlteration
enum class FortniteGame_EFortAlteration : uint8_t
{
	EFortAlteration__AttributeSlot = 0,
	EFortAlteration__GameplaySlot  = 1,
	EFortAlteration__ComplexCosmeticSlot = 2,
	EFortAlteration__ColorSlot     = 3,
	EFortAlteration__HeroSpecializationTier1Slot = 4,
	EFortAlteration__HeroSpecializationTier2Slot = 5,
	EFortAlteration__HeroSpecializationTier3Slot = 6,
	EFortAlteration__HeroSpecializationTier4Slot = 7,
	EFortAlteration__EFortAlteration_MAX = 8,

};

// Enum FortniteGame.EFortTeamAffiliation
enum class FortniteGame_EFortTeamAffiliation : uint8_t
{
	EFortTeamAffiliation__Friendly = 0,
	EFortTeamAffiliation__Neutral  = 1,
	EFortTeamAffiliation__Hostile  = 2,
	EFortTeamAffiliation__EFortTeamAffiliation_MAX = 3,

};

// Enum FortniteGame.EFortInventoryType
enum class FortniteGame_EFortInventoryType : uint8_t
{
	EFortInventoryType__World      = 0,
	EFortInventoryType__Account    = 1,
	EFortInventoryType__MAX        = 2,
	EFortInventoryType__EFortInventoryType_MAX = 3,

};

// Enum FortniteGame.EFortAIUtility
enum class FortniteGame_EFortAIUtility : uint8_t
{
	EFortAIUtility__KillPlayersMelee = 0,
	EFortAIUtility__KillPlayersRanged = 1,
	EFortAIUtility__KillPlayersArtillery = 2,
	EFortAIUtility__DestroyBuildingsMelee = 3,
	EFortAIUtility__DestroyBuildingsRanged = 4,
	EFortAIUtility__DestroyBuildingsArtillery = 5,
	EFortAIUtility__DestroyTraps   = 6,
	EFortAIUtility__Tank           = 7,
	EFortAIUtility__Infiltrate     = 8,
	EFortAIUtility__Mob            = 9,
	EFortAIUtility__Support        = 10,
	EFortAIUtility__Kiting         = 11,
	EFortAIUtility__AreaOfDenial   = 12,
	EFortAIUtility__DisableTraps   = 13,
	EFortAIUtility__Dormant        = 14,
	EFortAIUtility__Assassin       = 15,
	EFortAIUtility__MAX            = 16,
	EFortAIUtility__EFortAIUtility_MAX = 17,

};

// Enum FortniteGame.EFortTileEdgeType
enum class FortniteGame_EFortTileEdgeType : uint8_t
{
	EFortTileEdgeType__Undefined   = 0,
	EFortTileEdgeType__Outer       = 1,
	EFortTileEdgeType__Transition  = 2,
	EFortTileEdgeType__Inner       = 3,
	EFortTileEdgeType__Border      = 4,
	EFortTileEdgeType__BorderTransitionSingle = 5,
	EFortTileEdgeType__BorderTransitionDouble = 6,
	EFortTileEdgeType__MAX         = 7,
	EFortTileEdgeType__EFortTileEdgeType_MAX = 8,

};

// Enum FortniteGame.EFortRequestedGameplayAction
enum class FortniteGame_EFortRequestedGameplayAction : uint8_t
{
	EFortRequestedGameplayAction__ContinuePlaying = 0,
	EFortRequestedGameplayAction__StartPlaying = 1,
	EFortRequestedGameplayAction__StopPlaying = 2,
	EFortRequestedGameplayAction__EnterZone = 3,
	EFortRequestedGameplayAction__LeaveZone = 4,
	EFortRequestedGameplayAction__ReturnToMainMenu = 5,
	EFortRequestedGameplayAction__QuitGame = 6,
	EFortRequestedGameplayAction__Invalid = 7,
	EFortRequestedGameplayAction__EFortRequestedGameplayAction_MAX = 8,

};

// Enum FortniteGame.EFortGameplayState
enum class FortniteGame_EFortGameplayState : uint8_t
{
	EFortGameplayState__NormalGameplay = 0,
	EFortGameplayState__WaitingToStart = 1,
	EFortGameplayState__EndOfZone  = 2,
	EFortGameplayState__EnteringZone = 3,
	EFortGameplayState__LeavingZone = 4,
	EFortGameplayState__Invalid    = 5,
	EFortGameplayState__EFortGameplayState_MAX = 6,

};

// Enum FortniteGame.EFortEncounterDirection
enum class FortniteGame_EFortEncounterDirection : uint8_t
{
	EFortEncounterDirection__North = 0,
	EFortEncounterDirection__NorthEast = 1,
	EFortEncounterDirection__East  = 2,
	EFortEncounterDirection__SouthEast = 3,
	EFortEncounterDirection__South = 4,
	EFortEncounterDirection__SouthWest = 5,
	EFortEncounterDirection__West  = 6,
	EFortEncounterDirection__NorthWest = 7,
	EFortEncounterDirection__Max_None = 8,
	EFortEncounterDirection__EFortEncounterDirection_MAX = 9,

};

// Enum FortniteGame.EFortMovementUrgency
enum class FortniteGame_EFortMovementUrgency : uint8_t
{
	EFortMovementUrgency__None     = 0,
	EFortMovementUrgency__Low      = 1,
	EFortMovementUrgency__Medium   = 2,
	EFortMovementUrgency__High     = 3,
	EFortMovementUrgency__NumLevels = 4,
	EFortMovementUrgency__EFortMovementUrgency_MAX = 5,

};

// Enum FortniteGame.EFortMovementStyle
enum class FortniteGame_EFortMovementStyle : uint8_t
{
	EFortMovementStyle__Running    = 0,
	EFortMovementStyle__Walking    = 1,
	EFortMovementStyle__Charging   = 2,
	EFortMovementStyle__Sprinting  = 3,
	EFortMovementStyle__EFortMovementStyle_MAX = 4,

};

// Enum FortniteGame.EFortWeaponTriggerType
enum class FortniteGame_EFortWeaponTriggerType : uint8_t
{
	EFortWeaponTriggerType__OnPress = 0,
	EFortWeaponTriggerType__Automatic = 1,
	EFortWeaponTriggerType__OnRelease = 2,
	EFortWeaponTriggerType__OnPressAndRelease = 3,
	EFortWeaponTriggerType__EFortWeaponTriggerType_MAX = 4,

};

// Enum FortniteGame.EFortJumpStaminaCost
enum class FortniteGame_EFortJumpStaminaCost : uint8_t
{
	EFortJumpStaminaCost__None     = 0,
	EFortJumpStaminaCost__Trigger  = 1,
	EFortJumpStaminaCost__SprintTrigger = 2,
	EFortJumpStaminaCost__SprintAir = 3,
	EFortJumpStaminaCost__EFortJumpStaminaCost_MAX = 4,

};

// Enum FortniteGame.EFortReportDayPhase
enum class FortniteGame_EFortReportDayPhase : uint8_t
{
	EFortReportDayPhase__Dawn      = 0,
	EFortReportDayPhase__Dusk      = 1,
	EFortReportDayPhase__ZoneFinished = 2,
	EFortReportDayPhase__EFortReportDayPhase_MAX = 3,

};

// Enum FortniteGame.EFortDayPhasePrio
enum class FortniteGame_EFortDayPhasePrio : uint8_t
{
	EFortDayPhasePrio__Default     = 0,
	EFortDayPhasePrio__DailySummary = 1,
	EFortDayPhasePrio__EFortDayPhasePrio_MAX = 2,

};

// Enum FortniteGame.EFortCustomBodyType
enum class FortniteGame_EFortCustomBodyType : uint8_t
{
	EFortCustomBodyType__Small     = 0,
	EFortCustomBodyType__Medium    = 1,
	EFortCustomBodyType__MediumAndSmall = 2,
	EFortCustomBodyType__Large     = 3,
	EFortCustomBodyType__LargeAndSmall = 4,
	EFortCustomBodyType__LargeAndMedium = 5,
	EFortCustomBodyType__All       = 6,
	EFortCustomBodyType__Deprecated = 7,
	EFortCustomBodyType__EFortCustomBodyType_MAX = 8,

};

// Enum FortniteGame.EFortDisplayGender
enum class FortniteGame_EFortDisplayGender : uint8_t
{
	EFortDisplayGender__Unknown    = 0,
	EFortDisplayGender__Male       = 1,
	EFortDisplayGender__Female     = 2,
	EFortDisplayGender__NumTypes   = 3,
	EFortDisplayGender__EFortDisplayGender_MAX = 4,

};

// Enum FortniteGame.EFortCustomGender
enum class FortniteGame_EFortCustomGender : uint8_t
{
	EFortCustomGender__Invalid     = 0,
	EFortCustomGender__Male        = 1,
	EFortCustomGender__Female      = 2,
	EFortCustomGender__Both        = 3,
	EFortCustomGender__EFortCustomGender_MAX = 4,

};

// Enum FortniteGame.EFortCompletionResult
enum class FortniteGame_EFortCompletionResult : uint8_t
{
	EFortCompletionResult__Win     = 0,
	EFortCompletionResult__Loss    = 1,
	EFortCompletionResult__Draw    = 2,
	EFortCompletionResult__Undefined = 3,
	EFortCompletionResult__EFortCompletionResult_MAX = 4,

};

// Enum FortniteGame.EFortPvPGameResult
enum class FortniteGame_EFortPvPGameResult : uint8_t
{
	EFortPvPGameResult__Win        = 0,
	EFortPvPGameResult__Loss       = 1,
	EFortPvPGameResult__Draw       = 2,
	EFortPvPGameResult__EFortPvPGameResult_MAX = 3,

};

// Enum FortniteGame.EFortItemTier
enum class FortniteGame_EFortItemTier : uint8_t
{
	EFortItemTier__No_Tier         = 0,
	EFortItemTier__I               = 1,
	EFortItemTier__II              = 2,
	EFortItemTier__III             = 3,
	EFortItemTier__IV              = 4,
	EFortItemTier__V               = 5,
	EFortItemTier__VI              = 6,
	EFortItemTier__VII             = 7,
	EFortItemTier__VIII            = 8,
	EFortItemTier__IX              = 9,
	EFortItemTier__X               = 10,
	EFortItemTier__NumItemTierValues = 11,
	EFortItemTier__EFortItemTier_MAX = 12,

};

// Enum FortniteGame.EFortQuality
enum class FortniteGame_EFortQuality : uint8_t
{
	EFortQuality__Common           = 0,
	EFortQuality__Uncommon         = 1,
	EFortQuality__Rare             = 2,
	EFortQuality__NumQualityValues = 3,
	EFortQuality__EFortQuality_MAX = 4,

};

// Enum FortniteGame.EFortRarity
enum class FortniteGame_EFortRarity : uint8_t
{
	EFortRarity__Handmade          = 0,
	EFortRarity__Ordinary          = 1,
	EFortRarity__Sturdy            = 2,
	EFortRarity__Quality           = 3,
	EFortRarity__Fine              = 4,
	EFortRarity__Elegant           = 5,
	EFortRarity__Masterwork        = 6,
	EFortRarity__Epic              = 7,
	EFortRarity__Badass            = 8,
	EFortRarity__Legendary         = 9,
	EFortRarity__NumRarityValues   = 10,
	EFortRarity__EFortRarity_MAX   = 11,

};

// Enum FortniteGame.EFortItemPropertyType
enum class FortniteGame_EFortItemPropertyType : uint8_t
{
	EFortItemPropertyType__None    = 0,
	EFortItemPropertyType__DisplayName = 1,
	EFortItemPropertyType__Damage  = 2,
	EFortItemPropertyType__EnvDamage = 3,
	EFortItemPropertyType__Reload  = 4,
	EFortItemPropertyType__HorizontalRecoil = 5,
	EFortItemPropertyType__VerticalRecoil = 6,
	EFortItemPropertyType__RateOfFire = 7,
	EFortItemPropertyType__Durability = 8,
	EFortItemPropertyType__HealthRestored = 9,
	EFortItemPropertyType__StackCount = 10,
	EFortItemPropertyType__StunTime = 11,
	EFortItemPropertyType__Uses    = 12,
	EFortItemPropertyType__Description = 13,
	EFortItemPropertyType__MagCapacity = 14,
	EFortItemPropertyType__AmmoImage = 15,
	EFortItemPropertyType__Rarity  = 16,
	EFortItemPropertyType__Personality = 17,
	EFortItemPropertyType__SetBonus = 18,
	EFortItemPropertyType__Count_AlwaysAtEnd = 19,
	EFortItemPropertyType__EFortItemPropertyType_MAX = 20,

};

// Enum FortniteGame.EFortTargetSelectionFilter
enum class FortniteGame_EFortTargetSelectionFilter : uint8_t
{
	EFortTargetSelectionFilter__Damageable = 0,
	EFortTargetSelectionFilter__Everything = 1,
	EFortTargetSelectionFilter__Pawns = 2,
	EFortTargetSelectionFilter__Buildings = 3,
	EFortTargetSelectionFilter__Walls = 4,
	EFortTargetSelectionFilter__Traps = 5,
	EFortTargetSelectionFilter__Players = 6,
	EFortTargetSelectionFilter__AIPawns = 7,
	EFortTargetSelectionFilter__Instigator = 8,
	EFortTargetSelectionFilter__WeakSpots = 9,
	EFortTargetSelectionFilter__World = 10,
	EFortTargetSelectionFilter__Max = 11,
	EFortTargetSelectionFilter__EFortTargetSelectionFilter_MAX = 12,

};

// Enum FortniteGame.EFortTargetSelectionTestType
enum class FortniteGame_EFortTargetSelectionTestType : uint8_t
{
	EFortTargetSelectionTestType__Overlap = 0,
	EFortTargetSelectionTestType__Swept = 1,
	EFortTargetSelectionTestType__Ballistic = 2,
	EFortTargetSelectionTestType__EFortTargetSelectionTestType_MAX = 3,

};

// Enum FortniteGame.EFortTargetSelectionShape
enum class FortniteGame_EFortTargetSelectionShape : uint8_t
{
	EFortTargetSelectionShape__Sphere = 0,
	EFortTargetSelectionShape__Cone = 1,
	EFortTargetSelectionShape__Box = 2,
	EFortTargetSelectionShape__Capsule = 3,
	EFortTargetSelectionShape__Line = 4,
	EFortTargetSelectionShape__Custom = 5,
	EFortTargetSelectionShape__EFortTargetSelectionShape_MAX = 6,

};

// Enum FortniteGame.EFortInventoryFilter
enum class FortniteGame_EFortInventoryFilter : uint8_t
{
	EFortInventoryFilter__WeaponMelee = 0,
	EFortInventoryFilter__WeaponRanged = 1,
	EFortInventoryFilter__Ammo     = 2,
	EFortInventoryFilter__Traps    = 3,
	EFortInventoryFilter__Consumables = 4,
	EFortInventoryFilter__Ingredients = 5,
	EFortInventoryFilter__Gadget   = 6,
	EFortInventoryFilter__Decorations = 7,
	EFortInventoryFilter__Invisible = 8,
	EFortInventoryFilter__Max_None = 9,
	EFortInventoryFilter__EFortInventoryFilter_MAX = 10,

};

// Enum FortniteGame.EFortPartialPathUsage
enum class FortniteGame_EFortPartialPathUsage : uint8_t
{
	EFortPartialPathUsage__Always  = 0,
	EFortPartialPathUsage__OnlyGoalsOnDestructible = 1,
	EFortPartialPathUsage__Never   = 2,
	EFortPartialPathUsage__EFortPartialPathUsage_MAX = 3,

};

// Enum FortniteGame.EFortHotSpotDirection
enum class FortniteGame_EFortHotSpotDirection : uint8_t
{
	EFortHotSpotDirection__PositiveX = 0,
	EFortHotSpotDirection__NegativeX = 1,
	EFortHotSpotDirection__PositiveY = 2,
	EFortHotSpotDirection__NegativeY = 3,
	EFortHotSpotDirection__PositiveZ = 4,
	EFortHotSpotDirection__NegativeZ = 5,
	EFortHotSpotDirection__Any     = 6,
	EFortHotSpotDirection__EFortHotSpotDirection_MAX = 7,

};

// Enum FortniteGame.EFortHotSpotSlot
enum class FortniteGame_EFortHotSpotSlot : uint8_t
{
	EFortHotSpotSlot__Melee        = 0,
	EFortHotSpotSlot__MeleeHuge    = 1,
	EFortHotSpotSlot__Ranged       = 2,
	EFortHotSpotSlot__None         = 3,
	EFortHotSpotSlot__EFortHotSpotSlot_MAX = 4,

};

// Enum FortniteGame.EBumpIntoSleepingReaction
enum class FortniteGame_EBumpIntoSleepingReaction : uint8_t
{
	EBumpIntoSleepingReaction__WakeUp = 0,
	EBumpIntoSleepingReaction__Ignore = 1,
	EBumpIntoSleepingReaction__Sleep = 2,
	EBumpIntoSleepingReaction__EBumpIntoSleepingReaction_MAX = 3,

};

// Enum FortniteGame.EBuildingFloorRailing
enum class FortniteGame_EBuildingFloorRailing : uint8_t
{
	EBuildingFloorRailing__None    = 0,
	EBuildingFloorRailing__Balcony = 1,
	EBuildingFloorRailing__EBuildingFloorRailing_MAX = 2,

};

// Enum FortniteGame.EBuildingStairsRailing
enum class FortniteGame_EBuildingStairsRailing : uint8_t
{
	EBuildingStairsRailing__None   = 0,
	EBuildingStairsRailing__Partial = 1,
	EBuildingStairsRailing__Full   = 2,
	EBuildingStairsRailing__EBuildingStairsRailing_MAX = 3,

};

// Enum FortniteGame.EBuildingWallArea
enum class FortniteGame_EBuildingWallArea : uint8_t
{
	EBuildingWallArea__Regular     = 0,
	EBuildingWallArea__Flat        = 1,
	EBuildingWallArea__Special     = 2,
	EBuildingWallArea__EBuildingWallArea_MAX = 3,

};

// Enum FortniteGame.EAssignmentType
enum class FortniteGame_EAssignmentType : uint8_t
{
	EAssignmentType__Invalid       = 0,
	EAssignmentType__Encounter     = 1,
	EAssignmentType__World         = 2,
	EAssignmentType__Enemy         = 3,
	EAssignmentType__NumAssignmentTypes = 4,
	EAssignmentType__EAssignmentType_MAX = 5,

};

// Enum FortniteGame.EBoundingBoxSlotDirectionCalculation
enum class FortniteGame_EBoundingBoxSlotDirectionCalculation : uint8_t
{
	EBoundingBoxSlotDirectionCalculation__Auto = 0,
	EBoundingBoxSlotDirectionCalculation__FaceWall = 1,
	EBoundingBoxSlotDirectionCalculation__FaceAwayFromWall = 2,
	EBoundingBoxSlotDirectionCalculation__FaceCenter = 3,
	EBoundingBoxSlotDirectionCalculation__EBoundingBoxSlotDirectionCalculation_MAX = 4,

};

// Enum FortniteGame.EFortSessionHelperJoinState
enum class FortniteGame_EFortSessionHelperJoinState : uint8_t
{
	EFortSessionHelperJoinState__NotJoining = 0,
	EFortSessionHelperJoinState__RequestingReservation = 1,
	EFortSessionHelperJoinState__FailedReservation = 2,
	EFortSessionHelperJoinState__WaitingOnGame = 3,
	EFortSessionHelperJoinState__AttemptingJoin = 4,
	EFortSessionHelperJoinState__JoiningSession = 5,
	EFortSessionHelperJoinState__FailedJoin = 6,
	EFortSessionHelperJoinState__EFortSessionHelperJoinState_MAX = 7,

};

// Enum FortniteGame.EFortSessionHelperJoinResult
enum class FortniteGame_EFortSessionHelperJoinResult : uint8_t
{
	EFortSessionHelperJoinResult__NoResult = 0,
	EFortSessionHelperJoinResult__ReservationSuccess = 1,
	EFortSessionHelperJoinResult__ReservationFailure = 2,
	EFortSessionHelperJoinResult__JoinSessionSuccess = 3,
	EFortSessionHelperJoinResult__JoinSessionFailure = 4,
	EFortSessionHelperJoinResult__EFortSessionHelperJoinResult_MAX = 5,

};

// Enum FortniteGame.EMatchmakingFlags
enum class FortniteGame_EMatchmakingFlags : uint8_t
{
	EMatchmakingFlags__None        = 0,
	EMatchmakingFlags__CreateNewOnly = 1,
	EMatchmakingFlags__NoReservation = 2,
	EMatchmakingFlags__Private     = 3,
	EMatchmakingFlags__UseWorldDataOwner = 4,
	EMatchmakingFlags__EMatchmakingFlags_MAX = 5,

};

// Enum FortniteGame.EMatchmakingStartLocation
enum class FortniteGame_EMatchmakingStartLocation : uint8_t
{
	EMatchmakingStartLocation__Lobby = 0,
	EMatchmakingStartLocation__Game = 1,
	EMatchmakingStartLocation__CreateNew = 2,
	EMatchmakingStartLocation__FindSingle = 3,
	EMatchmakingStartLocation__EMatchmakingStartLocation_MAX = 4,

};

// Enum FortniteGame.EFortRewardType
enum class FortniteGame_EFortRewardType : uint8_t
{
	EFortRewardType__Default       = 0,
	EFortRewardType__Missed        = 1,
	EFortRewardType__Max_None      = 2,
	EFortRewardType__EFortRewardType_MAX = 3,

};

// Enum FortniteGame.EFortRewardActivityType
enum class FortniteGame_EFortRewardActivityType : uint8_t
{
	EFortRewardActivityType__General = 0,
	EFortRewardActivityType__MissionPrimary = 1,
	EFortRewardActivityType__MissionSecondary = 2,
	EFortRewardActivityType__Campaign = 3,
	EFortRewardActivityType__AccountLevelUp = 4,
	EFortRewardActivityType__HeroLevelUp = 5,
	EFortRewardActivityType__Max_None = 6,
	EFortRewardActivityType__EFortRewardActivityType_MAX = 7,

};

// Enum FortniteGame.EFortItemEntryState
enum class FortniteGame_EFortItemEntryState : uint8_t
{
	EFortItemEntryState__NoneState = 0,
	EFortItemEntryState__NewItemCount = 1,
	EFortItemEntryState__ShouldShowItemToast = 2,
	EFortItemEntryState__DurabilityInitialized = 3,
	EFortItemEntryState__DoNotShowSpawnParticles = 4,
	EFortItemEntryState__FromRecoveredBackpack = 5,
	EFortItemEntryState__FromGift  = 6,
	EFortItemEntryState__PendingUpgradeCriteriaProgress = 7,
	EFortItemEntryState__OwnerBuildingHandle = 8,
	EFortItemEntryState__FromDroppedPickup = 9,
	EFortItemEntryState__EFortItemEntryState_MAX = 10,

};

// Enum FortniteGame.EFortWorldPrivacy
enum class FortniteGame_EFortWorldPrivacy : uint8_t
{
	EFortWorldPrivacy__Public      = 0,
	EFortWorldPrivacy__FriendsOnly = 1,
	EFortWorldPrivacy__Private     = 2,
	EFortWorldPrivacy__Max         = 3,
	EFortWorldPrivacy__EFortWorldPrivacy_MAX = 4,

};

// Enum FortniteGame.EMyFortBuildingCategory
enum class FortniteGame_EMyFortBuildingCategory : uint8_t
{
	EMyFortBuildingCategory__Training = 0,
	EMyFortBuildingCategory__Administration = 1,
	EMyFortBuildingCategory__Production = 2,
	EMyFortBuildingCategory__Fortification = 3,
	EMyFortBuildingCategory__Crafting = 4,
	EMyFortBuildingCategory__Max_None = 5,
	EMyFortBuildingCategory__EMyFortBuildingCategory_MAX = 6,

};

// Enum FortniteGame.EStatCategory
enum class FortniteGame_EStatCategory : uint8_t
{
	EStatCategory__Combat          = 0,
	EStatCategory__Building        = 1,
	EStatCategory__Utility         = 2,
	EStatCategory__EStatCategory_MAX = 3,

};

// Enum FortniteGame.EFortReplicatedStat
enum class FortniteGame_EFortReplicatedStat : uint8_t
{
	EFortReplicatedStat__MonsterKills = 0,
	EFortReplicatedStat__MonsterDamagePoints = 1,
	EFortReplicatedStat__PlayerKills = 2,
	EFortReplicatedStat__WoodGathered = 3,
	EFortReplicatedStat__StoneGathered = 4,
	EFortReplicatedStat__MetalGathered = 5,
	EFortReplicatedStat__Deaths    = 6,
	EFortReplicatedStat__BuildingsBuilt = 7,
	EFortReplicatedStat__BuildingsBuilt_Wood = 8,
	EFortReplicatedStat__BuildingsBuilt_Stone = 9,
	EFortReplicatedStat__BuildingsBuilt_Metal = 10,
	EFortReplicatedStat__BuildingsUpgraded_Wood2 = 11,
	EFortReplicatedStat__BuildingsUpgraded_Wood3 = 12,
	EFortReplicatedStat__BuildingsUpgraded_Stone2 = 13,
	EFortReplicatedStat__BuildingsUpgraded_Stone3 = 14,
	EFortReplicatedStat__BuildingsUpgraded_Metal2 = 15,
	EFortReplicatedStat__BuildingsUpgraded_Metal3 = 16,
	EFortReplicatedStat__BuildingsDestroyed = 17,
	EFortReplicatedStat__Repair_Wood = 18,
	EFortReplicatedStat__Repair_Stone = 19,
	EFortReplicatedStat__Repair_Metal = 20,
	EFortReplicatedStat__FlagsCaptured = 21,
	EFortReplicatedStat__FlagsReturned = 22,
	EFortReplicatedStat__ContainersLooted = 23,
	EFortReplicatedStat__CraftingPoints = 24,
	EFortReplicatedStat__TrapPlacementPoints = 25,
	EFortReplicatedStat__TrapActivationPoints = 26,
	EFortReplicatedStat__TotalScore = 27,
	EFortReplicatedStat__OldTotalScore = 28,
	EFortReplicatedStat__CombatScore = 29,
	EFortReplicatedStat__BuildingScore = 30,
	EFortReplicatedStat__UtilityScore = 31,
	EFortReplicatedStat__None      = 32,
	EFortReplicatedStat__MAX       = 33,
	EFortReplicatedStat__EFortReplicatedStat_MAX = 34,

};

// Enum FortniteGame.EFortReplenishmentType
enum class FortniteGame_EFortReplenishmentType : uint8_t
{
	EFortReplenishmentType__Restricted = 0,
	EFortReplenishmentType__ClampMin = 1,
	EFortReplenishmentType__Add    = 2,
	EFortReplenishmentType__Ability = 3,
	EFortReplenishmentType__EFortReplenishmentType_MAX = 4,

};

// Enum FortniteGame.EFortItemType
enum class FortniteGame_EFortItemType : uint8_t
{
	EFortItemType__WorldItem       = 0,
	EFortItemType__Ammo            = 1,
	EFortItemType__Badge           = 2,
	EFortItemType__BackpackPickup  = 3,
	EFortItemType__BuildingPiece   = 4,
	EFortItemType__CharacterPart   = 5,
	EFortItemType__Deco            = 6,
	EFortItemType__EditTool        = 7,
	EFortItemType__Food            = 8,
	EFortItemType__Gadget          = 9,
	EFortItemType__HomebaseGadget  = 10,
	EFortItemType__HeroAbility     = 11,
	EFortItemType__MissionItem     = 12,
	EFortItemType__Trap            = 13,
	EFortItemType__Weapon          = 14,
	EFortItemType__WeaponMelee     = 15,
	EFortItemType__WeaponRanged    = 16,
	EFortItemType__WeaponHarvest   = 17,
	EFortItemType__WorldResource   = 18,
	EFortItemType__Outpost         = 19,
	EFortItemType__AccountItem     = 20,
	EFortItemType__AccountResource = 21,
	EFortItemType__Alteration      = 22,
	EFortItemType__CardPack        = 23,
	EFortItemType__CharacterCosmetic = 24,
	EFortItemType__Currency        = 25,
	EFortItemType__Hero            = 26,
	EFortItemType__MyFortBuilding  = 27,
	EFortItemType__Schematic       = 28,
	EFortItemType__Ingredient      = 29,
	EFortItemType__Trait           = 30,
	EFortItemType__Worker          = 31,
	EFortItemType__Token           = 32,
	EFortItemType__HeroSpecialization = 33,
	EFortItemType__Quest           = 34,
	EFortItemType__Emote           = 35,
	EFortItemType__Stack           = 36,
	EFortItemType__Profile         = 37,
	EFortItemType__Max_None        = 38,
	EFortItemType__EFortItemType_MAX = 39,

};

// Enum FortniteGame.EFortTemplateAccess
enum class FortniteGame_EFortTemplateAccess : uint8_t
{
	EFortTemplateAccess__Normal    = 0,
	EFortTemplateAccess__Trusted   = 1,
	EFortTemplateAccess__Private   = 2,
	EFortTemplateAccess__EFortTemplateAccess_MAX = 3,
	EFortTemplateAccess__Invalid   = 4,

};

// Enum FortniteGame.ESpecializationType
enum class FortniteGame_ESpecializationType : uint8_t
{
	ESpecializationType__Tier1     = 0,
	ESpecializationType__Tier2     = 1,
	ESpecializationType__Tier3     = 2,
	ESpecializationType__Tier4     = 3,
	ESpecializationType__NumTiers  = 4,
	ESpecializationType__ESpecializationType_MAX = 5,

};

// Enum FortniteGame.EMyTown3DRoadType
enum class FortniteGame_EMyTown3DRoadType : uint8_t
{
	EMyTown3DRoadType__UnbuiltUnbuilt = 0,
	EMyTown3DRoadType__UnbuiltBuilt = 1,
	EMyTown3DRoadType__BuiltBuilt  = 2,
	EMyTown3DRoadType__EMyTown3DRoadType_MAX = 3,

};

// Enum FortniteGame.EFortQuestState
enum class FortniteGame_EFortQuestState : uint8_t
{
	EFortQuestState__Inactive      = 0,
	EFortQuestState__Active        = 1,
	EFortQuestState__Completed     = 2,
	EFortQuestState__Claimed       = 3,
	EFortQuestState__EFortQuestState_MAX = 4,

};

// Enum FortniteGame.EFortHexTileAdjacency
enum class FortniteGame_EFortHexTileAdjacency : uint8_t
{
	EFortHexTileAdjacency__North   = 0,
	EFortHexTileAdjacency__NorthEast = 1,
	EFortHexTileAdjacency__SouthEast = 2,
	EFortHexTileAdjacency__South   = 3,
	EFortHexTileAdjacency__SouthWest = 4,
	EFortHexTileAdjacency__NorthWest = 5,
	EFortHexTileAdjacency__Max_None = 6,
	EFortHexTileAdjacency__EFortHexTileAdjacency_MAX = 7,

};

// Enum FortniteGame.EFortQuickBars
enum class FortniteGame_EFortQuickBars : uint8_t
{
	EFortQuickBars__Primary        = 0,
	EFortQuickBars__Secondary      = 1,
	EFortQuickBars__Max_None       = 2,
	EFortQuickBars__EFortQuickBars_MAX = 3,

};

// Enum FortniteGame.EFortEncounterSpawnLimitType
enum class FortniteGame_EFortEncounterSpawnLimitType : uint8_t
{
	EFortEncounterSpawnLimitType__NoLimit = 0,
	EFortEncounterSpawnLimitType__NumPawnsLimit = 1,
	EFortEncounterSpawnLimitType__SpawnPointLimit = 2,
	EFortEncounterSpawnLimitType__MAX = 3,
	EFortEncounterSpawnLimitType__EFortEncounterSpawnLimitType_MAX = 4,

};

// Enum FortniteGame.EFortEncounterUtilitiesMode
enum class FortniteGame_EFortEncounterUtilitiesMode : uint8_t
{
	EFortEncounterUtilitiesMode__LockedOnly = 0,
	EFortEncounterUtilitiesMode__LockedAndFree = 1,
	EFortEncounterUtilitiesMode__EFortEncounterUtilitiesMode_MAX = 2,

};

// Enum FortniteGame.EFortEncounterSpawnLocationPlacementMode
enum class FortniteGame_EFortEncounterSpawnLocationPlacementMode : uint8_t
{
	EFortEncounterSpawnLocationPlacementMode__Directional = 0,
	EFortEncounterSpawnLocationPlacementMode__Ring = 1,
	EFortEncounterSpawnLocationPlacementMode__Volume = 2,
	EFortEncounterSpawnLocationPlacementMode__Custom = 3,
	EFortEncounterSpawnLocationPlacementMode__Max_None = 4,
	EFortEncounterSpawnLocationPlacementMode__EFortEncounterSpawnLocationPlacementMode_MAX = 5,

};

// Enum FortniteGame.EFortEncounterPacingMode
enum class FortniteGame_EFortEncounterPacingMode : uint8_t
{
	EFortEncounterPacingMode__SpawnPointsPercentageCurve = 0,
	EFortEncounterPacingMode__IntensityCurve = 1,
	EFortEncounterPacingMode__Burst = 2,
	EFortEncounterPacingMode__EFortEncounterPacingMode_MAX = 3,

};

// Enum FortniteGame.EFortTheaterType
enum class FortniteGame_EFortTheaterType : uint8_t
{
	EFortTheaterType__Standard     = 0,
	EFortTheaterType__PvP          = 1,
	EFortTheaterType__PvP2         = 2,
	EFortTheaterType__Tutorial     = 3,
	EFortTheaterType__TutorialGate = 4,
	EFortTheaterType__Test         = 5,
	EFortTheaterType__Max_None     = 6,
	EFortTheaterType__EFortTheaterType_MAX = 7,

};

// Enum FortniteGame.EFortTheaterMapTileType
enum class FortniteGame_EFortTheaterMapTileType : uint8_t
{
	EFortTheaterMapTileType__Normal = 0,
	EFortTheaterMapTileType__CriticalMission = 1,
	EFortTheaterMapTileType__AlwaysActive = 2,
	EFortTheaterMapTileType__Outpost = 3,
	EFortTheaterMapTileType__NonMission = 4,
	EFortTheaterMapTileType__EFortTheaterMapTileType_MAX = 5,

};

// Enum FortniteGame.EFortBounceType
enum class FortniteGame_EFortBounceType : uint8_t
{
	EFortBounceType__Hit           = 0,
	EFortBounceType__Interact      = 1,
	EFortBounceType__EditPlaced    = 2,
	EFortBounceType__EFortBounceType_MAX = 3,

};

// Enum FortniteGame.EBuildingHighlightType
enum class FortniteGame_EBuildingHighlightType : uint8_t
{
	EBuildingHighlightType__Primary = 0,
	EBuildingHighlightType__Interact = 1,
	EBuildingHighlightType__WillBeDestroyed = 2,
	EBuildingHighlightType__MAX    = 3,
	EBuildingHighlightType__EBuildingHighlightType_MAX = 4,

};

// Enum FortniteGame.EFortConnectivityCubeFace
enum class FortniteGame_EFortConnectivityCubeFace : uint8_t
{
	EFortConnectivityCubeFace__Front = 0,
	EFortConnectivityCubeFace__Left = 1,
	EFortConnectivityCubeFace__Back = 2,
	EFortConnectivityCubeFace__Right = 3,
	EFortConnectivityCubeFace__Upper = 4,
	EFortConnectivityCubeFace__Lower = 5,
	EFortConnectivityCubeFace__MAX = 6,
	EFortConnectivityCubeFace__EFortConnectivityCubeFace_MAX = 7,

};

// Enum FortniteGame.EFortDecoPlacementQueryResults
enum class FortniteGame_EFortDecoPlacementQueryResults : uint8_t
{
	EFortDecoPlacementQueryResults__CanAdd = 0,
	EFortDecoPlacementQueryResults__ExistingTrap = 1,
	EFortDecoPlacementQueryResults__ExistingObject = 2,
	EFortDecoPlacementQueryResults__Obstructed = 3,
	EFortDecoPlacementQueryResults__NoLocation = 4,
	EFortDecoPlacementQueryResults__WrongType = 5,
	EFortDecoPlacementQueryResults__WrongShape = 6,
	EFortDecoPlacementQueryResults__BeingModified = 7,
	EFortDecoPlacementQueryResults__WrongTeam = 8,
	EFortDecoPlacementQueryResults__BlueprintFailure = 9,
	EFortDecoPlacementQueryResults__AbilityFailure = 10,
	EFortDecoPlacementQueryResults__RequiresPlayerBuildableActor = 11,
	EFortDecoPlacementQueryResults__EFortDecoPlacementQueryResults_MAX = 12,

};

// Enum FortniteGame.EFortStructuralGridQueryResults
enum class FortniteGame_EFortStructuralGridQueryResults : uint8_t
{
	EFortStructuralGridQueryResults__CanAdd = 0,
	EFortStructuralGridQueryResults__ExistingActor = 1,
	EFortStructuralGridQueryResults__Obstructed = 2,
	EFortStructuralGridQueryResults__NoStructuralSupport = 3,
	EFortStructuralGridQueryResults__InvalidActor = 4,
	EFortStructuralGridQueryResults__ReachedLimit = 5,
	EFortStructuralGridQueryResults__EFortStructuralGridQueryResults_MAX = 6,

};

// Enum FortniteGame.EFortCostInfoTypes
enum class FortniteGame_EFortCostInfoTypes : uint8_t
{
	EFortCostInfoTypes__Placement  = 0,
	EFortCostInfoTypes__Repair     = 1,
	EFortCostInfoTypes__Conversion = 2,
	EFortCostInfoTypes__Ability    = 3,
	EFortCostInfoTypes__None       = 4,
	EFortCostInfoTypes__EFortCostInfoTypes_MAX = 5,

};

// Enum FortniteGame.EFortBuildingInitializationReason
enum class FortniteGame_EFortBuildingInitializationReason : uint8_t
{
	EFortBuildingInitializationReason__StaticallyPlaced = 0,
	EFortBuildingInitializationReason__Spawned = 1,
	EFortBuildingInitializationReason__Replaced = 2,
	EFortBuildingInitializationReason__LoadedFromSave = 3,
	EFortBuildingInitializationReason__DynamicBuilderPlaced = 4,
	EFortBuildingInitializationReason__PlacementTool = 5,
	EFortBuildingInitializationReason__TrapTool = 6,
	EFortBuildingInitializationReason__None = 7,
	EFortBuildingInitializationReason__EFortBuildingInitializationReason_MAX = 8,

};

// Enum FortniteGame.EFortBuildingPersistentState
enum class FortniteGame_EFortBuildingPersistentState : uint8_t
{
	EFortBuildingPersistentState__Default = 0,
	EFortBuildingPersistentState__New = 1,
	EFortBuildingPersistentState__Constructed = 2,
	EFortBuildingPersistentState__Destroyed = 3,
	EFortBuildingPersistentState__Searched = 4,
	EFortBuildingPersistentState__None = 5,
	EFortBuildingPersistentState__EFortBuildingPersistentState_MAX = 6,

};

// Enum FortniteGame.EFortBuildingState
enum class FortniteGame_EFortBuildingState : uint8_t
{
	EFortBuildingState__Placement  = 0,
	EFortBuildingState__EditMode   = 1,
	EFortBuildingState__None       = 2,
	EFortBuildingState__EFortBuildingState_MAX = 3,

};

// Enum FortniteGame.EFortResourceLevel
enum class FortniteGame_EFortResourceLevel : uint8_t
{
	EFortResourceLevel__First      = 0,
	EFortResourceLevel__Second     = 1,
	EFortResourceLevel__Third      = 2,
	EFortResourceLevel__Fourth     = 3,
	EFortResourceLevel__Fifth      = 4,
	EFortResourceLevel__Sixth      = 5,
	EFortResourceLevel__NumLevels  = 6,
	EFortResourceLevel__Invalid    = 7,
	EFortResourceLevel__EFortResourceLevel_MAX = 8,

};

// Enum FortniteGame.EFortResourceType
enum class FortniteGame_EFortResourceType : uint8_t
{
	EFortResourceType__Wood        = 0,
	EFortResourceType__Stone       = 1,
	EFortResourceType__Metal       = 2,
	EFortResourceType__Permanite   = 3,
	EFortResourceType__None        = 4,
	EFortResourceType__EFortResourceType_MAX = 5,

};

// Enum FortniteGame.EFortTextureDataSlot
enum class FortniteGame_EFortTextureDataSlot : uint8_t
{
	EFortTextureDataSlot__Primary  = 0,
	EFortTextureDataSlot__Secondary = 1,
	EFortTextureDataSlot__Tertiary = 2,
	EFortTextureDataSlot__Fourth   = 3,
	EFortTextureDataSlot__NumSlots = 4,
	EFortTextureDataSlot__EFortTextureDataSlot_MAX = 5,

};

// Enum FortniteGame.EFortTextureDataType
enum class FortniteGame_EFortTextureDataType : uint8_t
{
	EFortTextureDataType__Any      = 0,
	EFortTextureDataType__OuterWall = 1,
	EFortTextureDataType__InnerWall = 2,
	EFortTextureDataType__Corner   = 3,
	EFortTextureDataType__Floor    = 4,
	EFortTextureDataType__Ceiling  = 5,
	EFortTextureDataType__Trim     = 6,
	EFortTextureDataType__Roof     = 7,
	EFortTextureDataType__Pillar   = 8,
	EFortTextureDataType__Shingle  = 9,
	EFortTextureDataType__None     = 10,
	EFortTextureDataType__EFortTextureDataType_MAX = 11,

};

// Enum FortniteGame.EFortBuildingType
enum class FortniteGame_EFortBuildingType : uint8_t
{
	EFortBuildingType__Wall        = 0,
	EFortBuildingType__Floor       = 1,
	EFortBuildingType__Corner      = 2,
	EFortBuildingType__Deco        = 3,
	EFortBuildingType__Prop        = 4,
	EFortBuildingType__Stairs      = 5,
	EFortBuildingType__Roof        = 6,
	EFortBuildingType__Pillar      = 7,
	EFortBuildingType__SpawnedItem = 8,
	EFortBuildingType__Container   = 9,
	EFortBuildingType__Trap        = 10,
	EFortBuildingType__GenericCenterCellActor = 11,
	EFortBuildingType__None        = 12,
	EFortBuildingType__EFortBuildingType_MAX = 13,

};

// Enum FortniteGame.EFortMissionType
enum class FortniteGame_EFortMissionType : uint8_t
{
	EFortMissionType__Primary      = 0,
	EFortMissionType__Secondary    = 1,
	EFortMissionType__Max_None     = 2,
	EFortMissionType__EFortMissionType_MAX = 3,

};

// Enum FortniteGame.EFortObjectiveRequirement
enum class FortniteGame_EFortObjectiveRequirement : uint8_t
{
	EFortObjectiveRequirement__Optional = 0,
	EFortObjectiveRequirement__Required = 1,
	EFortObjectiveRequirement__EFortObjectiveRequirement_MAX = 2,

};

// Enum FortniteGame.EFortMissionStatus
enum class FortniteGame_EFortMissionStatus : uint8_t
{
	EFortMissionStatus__Created    = 0,
	EFortMissionStatus__InProgress = 1,
	EFortMissionStatus__Succeeded  = 2,
	EFortMissionStatus__Failed     = 3,
	EFortMissionStatus__NeutralCompletion = 4,
	EFortMissionStatus__Max_None   = 5,
	EFortMissionStatus__EFortMissionStatus_MAX = 6,

};

// Enum FortniteGame.EFortObjectiveStatus
enum class FortniteGame_EFortObjectiveStatus : uint8_t
{
	EFortObjectiveStatus__Created  = 0,
	EFortObjectiveStatus__InProgress = 1,
	EFortObjectiveStatus__Succeeded = 2,
	EFortObjectiveStatus__Failed   = 3,
	EFortObjectiveStatus__NeutralCompletion = 4,
	EFortObjectiveStatus__Max_None = 5,
	EFortObjectiveStatus__EFortObjectiveStatus_MAX = 6,

};

// Enum FortniteGame.EMissionGenerationCategory
enum class FortniteGame_EMissionGenerationCategory : uint8_t
{
	EMissionGenerationCategory__Primary = 0,
	EMissionGenerationCategory__Secondary = 1,
	EMissionGenerationCategory__Tertiary = 2,
	EMissionGenerationCategory__Max_None = 3,
	EMissionGenerationCategory__EMissionGenerationCategory_MAX = 4,

};

// Enum FortniteGame.EFortObjectLibrary
enum class FortniteGame_EFortObjectLibrary : uint8_t
{
	EFortObjectLibrary__PlayerBuildingClass = 0,
	EFortObjectLibrary__BuildingTexture = 1,
	EFortObjectLibrary__NavAgentCost = 2,
	EFortObjectLibrary__Missions   = 3,
	EFortObjectLibrary__MissionInfo = 4,
	EFortObjectLibrary__MissionManagers = 5,
	EFortObjectLibrary__MissionGenerators = 6,
	EFortObjectLibrary__SpawnGroup = 7,
	EFortObjectLibrary__CharacterPart = 8,
	EFortObjectLibrary__ColorSwatch = 9,
	EFortObjectLibrary__EnemyMutators = 10,
	EFortObjectLibrary__WeaponData = 11,
	EFortObjectLibrary__AmmoData   = 12,
	EFortObjectLibrary__EmoteData  = 13,
	EFortObjectLibrary__ConsumableData = 14,
	EFortObjectLibrary__SchematicData = 15,
	EFortObjectLibrary__IngredientData = 16,
	EFortObjectLibrary__PersistentResourceData = 17,
	EFortObjectLibrary__GadgetData = 18,
	EFortObjectLibrary__TrapData   = 19,
	EFortObjectLibrary__TraitData  = 20,
	EFortObjectLibrary__HeroTypeData = 21,
	EFortObjectLibrary__WorkerTypeData = 22,
	EFortObjectLibrary__TokenTypeData = 23,
	EFortObjectLibrary__TownBuildingData = 24,
	EFortObjectLibrary__CurrencyData = 25,
	EFortObjectLibrary__AlterationData = 26,
	EFortObjectLibrary__CharacterCosmeticData = 27,
	EFortObjectLibrary__DecoData   = 28,
	EFortObjectLibrary__CardPackData = 29,
	EFortObjectLibrary__WorldItems = 30,
	EFortObjectLibrary__HeroSpecializationData = 31,
	EFortObjectLibrary__QuestData  = 32,
	EFortObjectLibrary__OutpostData = 33,
	EFortObjectLibrary__Max_None   = 34,
	EFortObjectLibrary__EFortObjectLibrary_MAX = 35,

};

// Enum FortniteGame.EFortOptionGenerationResult
enum class FortniteGame_EFortOptionGenerationResult : uint8_t
{
	EFortOptionGenerationResult__NoOptionsGenerated = 0,
	EFortOptionGenerationResult__NewOptionsGenerated = 1,
	EFortOptionGenerationResult__ExistingOptionsGenerated = 2,
	EFortOptionGenerationResult__EFortOptionGenerationResult_MAX = 3,

};

// Enum FortniteGame.EWorldOnlineState
enum class FortniteGame_EWorldOnlineState : uint8_t
{
	EWorldOnlineState__Offline     = 0,
	EWorldOnlineState__Online      = 1,
	EWorldOnlineState__EWorldOnlineState_MAX = 2,

};

// Enum FortniteGame.TInteractionType
enum class FortniteGame_ETInteractionType : uint8_t
{
	IT_NoInteraction               = 0,
	IT_Simple                      = 1,
	IT_LongPress                   = 2,
	IT_BuildingEdit                = 3,
	IT_BuildingImprovement         = 4,
	IT_MAX                         = 5,

};

// Enum FortniteGame.EFortFeedbackBroadcastFilter
enum class FortniteGame_EFortFeedbackBroadcastFilter : uint8_t
{
	FFBF_Speaker                   = 0,
	FFBF_SpeakerTeam               = 1,
	FFBF_SpeakerAdressee           = 2,
	FFBF_HumanPvP_Team1            = 3,
	FFBF_HumanPvP_Team2            = 4,
	FFBF_None_Max                  = 5,
	FFBF_MAX                       = 6,

};

// Enum FortniteGame.EFortFeedbackSelectionMethod
enum class FortniteGame_EFortFeedbackSelectionMethod : uint8_t
{
	FFSM_Instigator                = 0,
	FFSM_Recipient                 = 1,
	FFSM_TeamWitness               = 2,
	FFSM_EnemyWitness              = 3,
	FFSM_Random                    = 4,
	FFSM_Priority_IRTE             = 5,
	FFSM_AllPawns                  = 6,
	FFSM_Announcer                 = 7,
	FFSM_MAX                       = 8,

};

// Enum FortniteGame.EFortFeedbackAddressee
enum class FortniteGame_EFortFeedbackAddressee : uint8_t
{
	FFA_Instigator                 = 0,
	FFA_Recipient                  = 1,
	FFA_All                        = 2,
	FFA_MAX                        = 3,

};

// Enum FortniteGame.EFortFeedbackContext
enum class FortniteGame_EFortFeedbackContext : uint8_t
{
	FFC_Instigator                 = 0,
	FFC_Recipient                  = 1,
	FFC_TeamWitness                = 2,
	FFC_EnemyWitness               = 3,
	FFC_AllPawns                   = 4,
	FFC_Announcer                  = 5,
	FFC_None_Max                   = 6,
	FFC_MAX                        = 7,

};

// Enum FortniteGame.EFortMiniMapIconRotation
enum class FortniteGame_EFortMiniMapIconRotation : uint8_t
{
	EFMMIR_None                    = 0,
	EFMMIR_Absolute                = 1,
	EFMMIR_Relative                = 2,
	EFMMIR_MAX                     = 3,

};

// Enum FortniteGame.EFortMiniMapContext
enum class FortniteGame_EFortMiniMapContext : uint8_t
{
	EFMC_MiniMap                   = 0,
	EFMC_FullScreenMap             = 1,
	EFMC_MAX                       = 2,

};

// Enum FortniteGame.EFortMiniMapHeight
enum class FortniteGame_EFortMiniMapHeight : uint8_t
{
	EFMH_Equal                     = 0,
	EFMH_Below                     = 1,
	EFMH_Above                     = 2,
	EFMH_MAX                       = 3,

};

// Enum FortniteGame.EFortPIDValueGraphElements
enum class FortniteGame_EFortPIDValueGraphElements : uint8_t
{
	EFortPIDValueGraphElements__Proportional = 0,
	EFortPIDValueGraphElements__Integral = 1,
	EFortPIDValueGraphElements__Max_None = 2,
	EFortPIDValueGraphElements__EFortPIDValueGraphElements_MAX = 3,

};

// Enum FortniteGame.EFortIntensityGraphElements
enum class FortniteGame_EFortIntensityGraphElements : uint8_t
{
	EFortIntensityGraphElements__ActualIntensity = 0,
	EFortIntensityGraphElements__DesiredIntensity = 1,
	EFortIntensityGraphElements__Max_None = 2,
	EFortIntensityGraphElements__EFortIntensityGraphElements_MAX = 3,

};

// Enum FortniteGame.EFortContributionGraphElements
enum class FortniteGame_EFortContributionGraphElements : uint8_t
{
	EFortContributionGraphElements__ProportionalLine = 0,
	EFortContributionGraphElements__IntegralLine = 1,
	EFortContributionGraphElements__TotalLine = 2,
	EFortContributionGraphElements__PendingLine = 3,
	EFortContributionGraphElements__ActionLine = 4,
	EFortContributionGraphElements__Max_None = 5,
	EFortContributionGraphElements__EFortContributionGraphElements_MAX = 6,

};

// Enum FortniteGame.EFortFactorContributionType
enum class FortniteGame_EFortFactorContributionType : uint8_t
{
	EFortFactorContributionType__CurrentValue_Direct = 0,
	EFortFactorContributionType__CurrentValue_Inverse = 1,
	EFortFactorContributionType__AverageValue_Direct = 2,
	EFortFactorContributionType__AverageValue_Inverse = 3,
	EFortFactorContributionType__EFortFactorContributionType_MAX = 4,

};

// Enum FortniteGame.EFortAIDirectorFactor
enum class FortniteGame_EFortAIDirectorFactor : uint8_t
{
	EFortAIDirectorFactor__PlayerDamageThreat = 0,
	EFortAIDirectorFactor__ObjectiveDamageThreat = 1,
	EFortAIDirectorFactor__ObjectivePathCost = 2,
	EFortAIDirectorFactor__PlayerPathCost = 3,
	EFortAIDirectorFactor__PlayerMovement = 4,
	EFortAIDirectorFactor__TrapsEffective = 5,
	EFortAIDirectorFactor__PlayerWander = 6,
	EFortAIDirectorFactor__NearbyEnemyPresence = 7,
	EFortAIDirectorFactor__OffensiveResources = 8,
	EFortAIDirectorFactor__DefensiveResources = 9,
	EFortAIDirectorFactor__Boredom = 10,
	EFortAIDirectorFactor__ArtilleryVulnerability = 11,
	EFortAIDirectorFactor__Max_None = 12,
	EFortAIDirectorFactor__EFortAIDirectorFactor_MAX = 13,

};

// Enum FortniteGame.EFortCombatFactors
enum class FortniteGame_EFortCombatFactors : uint8_t
{
	EFortCombatFactors__PlayerDamageThreat = 0,
	EFortCombatFactors__ObjectiveDamageThreat = 1,
	EFortCombatFactors__ObjectivePathCost = 2,
	EFortCombatFactors__PlayerPathCost = 3,
	EFortCombatFactors__PlayerMovement = 4,
	EFortCombatFactors__TrapsEffective = 5,
	EFortCombatFactors__PlayerWander = 6,
	EFortCombatFactors__NearbyEnemyPresence = 7,
	EFortCombatFactors__OffensiveResources = 8,
	EFortCombatFactors__DefensiveResources = 9,
	EFortCombatFactors__Boredom    = 10,
	EFortCombatFactors__ArtilleryVulnerability = 11,
	EFortCombatFactors__Max_None   = 12,
	EFortCombatFactors__EFortCombatFactors_MAX = 13,

};

// Enum FortniteGame.EFortCombatEvents
enum class FortniteGame_EFortCombatEvents : uint8_t
{
	EFortCombatEvents__HuskFollowing = 0,
	EFortCombatEvents__SmasherFollowing = 1,
	EFortCombatEvents__TrollFollowing = 2,
	EFortCombatEvents__TakerFollowing = 3,
	EFortCombatEvents__PlayerTakeDamage = 4,
	EFortCombatEvents__PlayerHealth = 5,
	EFortCombatEvents__PlayerLookAtEnemy = 6,
	EFortCombatEvents__PlayerDamageEnemy = 7,
	EFortCombatEvents__PlayerKilledEnemy = 8,
	EFortCombatEvents__AtlasTakeDamage = 9,
	EFortCombatEvents__AtlasHealth = 10,
	EFortCombatEvents__AtlasDestroyed = 11,
	EFortCombatEvents__TrapFiring  = 12,
	EFortCombatEvents__BuildingTakeDamage = 13,
	EFortCombatEvents__FoodHealingPotential = 14,
	EFortCombatEvents__PlayerAmmo  = 15,
	EFortCombatEvents__EnemiesNear = 16,
	EFortCombatEvents__PlayerMovement = 17,
	EFortCombatEvents__BuildingDamagedNearObjective = 18,
	EFortCombatEvents__TrapDamageEnemy = 19,
	EFortCombatEvents__ObjectivePathCost = 20,
	EFortCombatEvents__PlayerPathCost = 21,
	EFortCombatEvents__Max_None    = 22,
	EFortCombatEvents__EFortCombatEvents_MAX = 23,

};

// Enum FortniteGame.EFortAIDirectorEventParticipant
enum class FortniteGame_EFortAIDirectorEventParticipant : uint8_t
{
	EFortAIDirectorEventParticipant__Target = 0,
	EFortAIDirectorEventParticipant__Source = 1,
	EFortAIDirectorEventParticipant__Either = 2,
	EFortAIDirectorEventParticipant__Max_None = 3,
	EFortAIDirectorEventParticipant__EFortAIDirectorEventParticipant_MAX = 4,

};

// Enum FortniteGame.EFortCombatThresholds
enum class FortniteGame_EFortCombatThresholds : uint8_t
{
	EFortCombatThresholds__Low     = 0,
	EFortCombatThresholds__Medium  = 1,
	EFortCombatThresholds__High    = 2,
	EFortCombatThresholds__Extreme = 3,
	EFortCombatThresholds__Max_None = 4,
	EFortCombatThresholds__EFortCombatThresholds_MAX = 5,

};

// Enum FortniteGame.EFortElementalDamageType
enum class FortniteGame_EFortElementalDamageType : uint8_t
{
	EFortElementalDamageType__None = 0,
	EFortElementalDamageType__Fire = 1,
	EFortElementalDamageType__Ice  = 2,
	EFortElementalDamageType__Lightning = 3,
	EFortElementalDamageType__MAX  = 4,
	EFortElementalDamageType__EFortElementalDamageType_MAX = 5,

};

// Enum FortniteGame.EFortDamageZone
enum class FortniteGame_EFortDamageZone : uint8_t
{
	EFortDamageZone__Light         = 0,
	EFortDamageZone__Normal        = 1,
	EFortDamageZone__Critical      = 2,
	EFortDamageZone__Vulnerability = 3,
	EFortDamageZone__Max           = 4,
	EFortDamageZone__EFortDamageZone_MAX = 5,

};

// Enum FortniteGame.EFortBaseWeaponDamage
enum class FortniteGame_EFortBaseWeaponDamage : uint8_t
{
	EFortBaseWeaponDamage__Combat  = 0,
	EFortBaseWeaponDamage__Environmental = 1,
	EFortBaseWeaponDamage__EFortBaseWeaponDamage_MAX = 2,

};

// Enum FortniteGame.EFortWeaponCoreAnimation
enum class FortniteGame_EFortWeaponCoreAnimation : uint8_t
{
	EFortWeaponCoreAnimation__Melee = 0,
	EFortWeaponCoreAnimation__Pistol = 1,
	EFortWeaponCoreAnimation__Shotgun = 2,
	EFortWeaponCoreAnimation__PaperBlueprint = 3,
	EFortWeaponCoreAnimation__Rifle = 4,
	EFortWeaponCoreAnimation__MeleeOneHand = 5,
	EFortWeaponCoreAnimation__MachinePistol = 6,
	EFortWeaponCoreAnimation__RocketLauncher = 7,
	EFortWeaponCoreAnimation__GrenadeLauncher = 8,
	EFortWeaponCoreAnimation__GoingCommando = 9,
	EFortWeaponCoreAnimation__AssaultRifle = 10,
	EFortWeaponCoreAnimation__TacticalShotgun = 11,
	EFortWeaponCoreAnimation__SniperRifle = 12,
	EFortWeaponCoreAnimation__TrapPlacement = 13,
	EFortWeaponCoreAnimation__EFortWeaponCoreAnimation_MAX = 14,

};

// Enum FortniteGame.EFortReloadFXState
enum class FortniteGame_EFortReloadFXState : uint8_t
{
	EFortReloadFXState__ReloadStart = 0,
	EFortReloadFXState__ReloadCartridge = 1,
	EFortReloadFXState__ReloadEnd  = 2,
	EFortReloadFXState__Max_None   = 3,
	EFortReloadFXState__EFortReloadFXState_MAX = 4,

};

// Enum FortniteGame.EFortWeaponSoundState
enum class FortniteGame_EFortWeaponSoundState : uint8_t
{
	EFortWeaponSoundState__Normal  = 0,
	EFortWeaponSoundState__LowAmmo = 1,
	EFortWeaponSoundState__Degraded = 2,
	EFortWeaponSoundState__Max_None = 3,
	EFortWeaponSoundState__EFortWeaponSoundState_MAX = 4,

};

// Enum FortniteGame.EFortMontageInputType
enum class FortniteGame_EFortMontageInputType : uint8_t
{
	EFortMontageInputType__WindowClickOrHold = 0,
	EFortMontageInputType__WindowHoldOnly = 1,
	EFortMontageInputType__InstantClick = 2,
	EFortMontageInputType__EFortMontageInputType_MAX = 3,

};

// Enum FortniteGame.EFortAbilitySourceType
enum class FortniteGame_EFortAbilitySourceType : uint8_t
{
	EFortAbilitySourceType__Unknown = 0,
	EFortAbilitySourceType__Weapon = 1,
	EFortAbilitySourceType__Gadget = 2,
	EFortAbilitySourceType__Pawn   = 3,
	EFortAbilitySourceType__Building = 4,
	EFortAbilitySourceType__HomeBase = 5,
	EFortAbilitySourceType__EFortAbilitySourceType_MAX = 6,

};

// Enum FortniteGame.EFortAbilityTargetingSource
enum class FortniteGame_EFortAbilityTargetingSource : uint8_t
{
	EFortAbilityTargetingSource__Camera = 0,
	EFortAbilityTargetingSource__PawnForward = 1,
	EFortAbilityTargetingSource__PawnTowardsFocus = 2,
	EFortAbilityTargetingSource__WeaponForward = 3,
	EFortAbilityTargetingSource__WeaponTowardsFocus = 4,
	EFortAbilityTargetingSource__Custom = 5,
	EFortAbilityTargetingSource__Max_None = 6,
	EFortAbilityTargetingSource__EFortAbilityTargetingSource_MAX = 7,

};

// Enum FortniteGame.EFortAmmoType
enum class FortniteGame_EFortAmmoType : uint8_t
{
	EFortAmmoType__Pistol          = 0,
	EFortAmmoType__Shotgun         = 1,
	EFortAmmoType__Assault         = 2,
	EFortAmmoType__Sniper          = 3,
	EFortAmmoType__Energy          = 4,
	EFortAmmoType__EFortAmmoType_MAX = 5,

};

// Enum FortniteGame.EFortPawnStasisMode
enum class FortniteGame_EFortPawnStasisMode : uint8_t
{
	EFortPawnStasisMode__None      = 0,
	EFortPawnStasisMode__NoMovement = 1,
	EFortPawnStasisMode__NoMovementOrTurning = 2,
	EFortPawnStasisMode__EFortPawnStasisMode_MAX = 3,

};

// Enum FortniteGame.EFortNameValidationResult
enum class FortniteGame_EFortNameValidationResult : uint8_t
{
	EFortNameValidationResult__Valid = 0,
	EFortNameValidationResult__TooShort = 1,
	EFortNameValidationResult__TooLong = 2,
	EFortNameValidationResult__IllegalCharacter = 3,
	EFortNameValidationResult__EFortNameValidationResult_MAX = 4,

};

// Enum FortniteGame.EFortProximityBasedGEApplicationType
enum class FortniteGame_EFortProximityBasedGEApplicationType : uint8_t
{
	EFortProximityBasedGEApplicationType__ApplyOnProximityPulse = 0,
	EFortProximityBasedGEApplicationType__ApplyOnProximityTouch = 1,
	EFortProximityBasedGEApplicationType__ApplyOnlyDuringProximityTouch = 2,
	EFortProximityBasedGEApplicationType__EFortProximityBasedGEApplicationType_MAX = 3,

};

// Enum FortniteGame.ENavigationObstacleOverride
enum class FortniteGame_ENavigationObstacleOverride : uint8_t
{
	ENavigationObstacleOverride__UseMeshSettings = 0,
	ENavigationObstacleOverride__ForceEnabled = 1,
	ENavigationObstacleOverride__ForceDisabled = 2,
	ENavigationObstacleOverride__ENavigationObstacleOverride_MAX = 3,

};

// Enum FortniteGame.EDynamicBuildingPlacementType
enum class FortniteGame_EDynamicBuildingPlacementType : uint8_t
{
	EDynamicBuildingPlacementType__CountsTowardsBounds = 0,
	EDynamicBuildingPlacementType__DestroyIfColliding = 1,
	EDynamicBuildingPlacementType__DestroyAnythingThatCollides = 2,
	EDynamicBuildingPlacementType__EDynamicBuildingPlacementType_MAX = 3,

};

// Enum FortniteGame.EUnlockRules
enum class FortniteGame_EUnlockRules : uint8_t
{
	EUnlockRules__UR_Reset         = 0,
	EUnlockRules__UR_MaintainState = 1,
	EUnlockRules__UR_ResetDeactivate = 2,
	EUnlockRules__UR_MAX           = 3,

};

// Enum FortniteGame.EContentionRules
enum class FortniteGame_EContentionRules : uint8_t
{
	EContentionRules__CR_MajorityWins = 0,
	EContentionRules__CR_OneTeamOnlyWins = 1,
	EContentionRules__CR_MAX       = 2,

};

// Enum FortniteGame.EFortItemCollectorBehavior
enum class FortniteGame_EFortItemCollectorBehavior : uint8_t
{
	EFortItemCollectorBehavior__FirstToGoal = 0,
	EFortItemCollectorBehavior__FreeForAll = 1,
	EFortItemCollectorBehavior__TugOfWar = 2,
	EFortItemCollectorBehavior__EFortItemCollectorBehavior_MAX = 3,

};

// Enum FortniteGame.EFortItemCollectorState
enum class FortniteGame_EFortItemCollectorState : uint8_t
{
	EFortItemCollectorState__CanInteract = 0,
	EFortItemCollectorState__Active = 1,
	EFortItemCollectorState__Inactive = 2,
	EFortItemCollectorState__Captured = 3,
	EFortItemCollectorState__Invalid = 4,
	EFortItemCollectorState__EFortItemCollectorState_MAX = 5,

};

// Enum FortniteGame.EFortStrategicBuildingLevelCriteriaDisplayRepresentation
enum class FortniteGame_EFortStrategicBuildingLevelCriteriaDisplayRepresentation : uint8_t
{
	EFortStrategicBuildingLevelCriteriaDisplayRepresentation__Integer = 0,
	EFortStrategicBuildingLevelCriteriaDisplayRepresentation__Float = 1,
	EFortStrategicBuildingLevelCriteriaDisplayRepresentation__EFortStrategicBuildingLevelCriteriaDisplayRepresentation_MAX = 2,

};

// Enum FortniteGame.EFortStrategicBuildingCategory
enum class FortniteGame_EFortStrategicBuildingCategory : uint8_t
{
	EFortStrategicBuildingCategory__Defensive = 0,
	EFortStrategicBuildingCategory__Offensive = 1,
	EFortStrategicBuildingCategory__Utility = 2,
	EFortStrategicBuildingCategory__EFortStrategicBuildingCategory_MAX = 3,

};

// Enum FortniteGame.EFortRiftSlotStatus
enum class FortniteGame_EFortRiftSlotStatus : uint8_t
{
	EFortRiftSlotStatus__Reserved  = 0,
	EFortRiftSlotStatus__Occupied  = 1,
	EFortRiftSlotStatus__Max_None  = 2,
	EFortRiftSlotStatus__EFortRiftSlotStatus_MAX = 3,

};

// Enum FortniteGame.EBuildingNavObstacleType
enum class FortniteGame_EBuildingNavObstacleType : uint8_t
{
	EBuildingNavObstacleType__UnwalkableAll = 0,
	EBuildingNavObstacleType__UnwalkableHuskOnly = 1,
	EBuildingNavObstacleType__SmashWhenLowHeight = 2,
	EBuildingNavObstacleType__SmashAll = 3,
	EBuildingNavObstacleType__EBuildingNavObstacleType_MAX = 4,

};

// Enum FortniteGame.EBuildingReplacementType
enum class FortniteGame_EBuildingReplacementType : uint8_t
{
	BRT_None                       = 0,
	BRT_Edited                     = 1,
	BRT_Conversion                 = 2,
	BRT_MAX                        = 3,

};

// Enum FortniteGame.EPlacementType
enum class FortniteGame_EPlacementType : uint8_t
{
	EPlacementType__Free           = 0,
	EPlacementType__Grid           = 1,
	EPlacementType__None           = 2,
	EPlacementType__EPlacementType_MAX = 3,

};

// Enum FortniteGame.EBuildingAttachmentType
enum class FortniteGame_EBuildingAttachmentType : uint8_t
{
	ATTACH_Floor                   = 0,
	ATTACH_Wall                    = 1,
	ATTACH_Ceiling                 = 2,
	ATTACH_Corner                  = 3,
	ATTACH_All                     = 4,
	ATTACH_WallThenFloor           = 5,
	ATTACH_None                    = 6,
	ATTACH_MAX                     = 7,

};

// Enum FortniteGame.EBuildingAttachmentSlot
enum class FortniteGame_EBuildingAttachmentSlot : uint8_t
{
	SLOT_Floor                     = 0,
	SLOT_Wall                      = 1,
	SLOT_Ceiling                   = 2,
	SLOT_None                      = 3,
	SLOT_MAX                       = 4,

};

// Enum FortniteGame.EBuildingAnim
enum class FortniteGame_EBuildingAnim : uint8_t
{
	EBA_None                       = 0,
	EBA_Building                   = 1,
	EBA_Breaking                   = 2,
	EBA_Destruction                = 3,
	EBA_Placement                  = 4,
	EBA_BuildingCheat              = 5,
	EBA_LODEffect                  = 6,
	EBA_MAX                        = 7,

};

// Enum FortniteGame.ELootQuotaLevel
enum class FortniteGame_ELootQuotaLevel : uint8_t
{
	ELootQuotaLevel__Unlimited     = 0,
	ELootQuotaLevel__Level1        = 1,
	ELootQuotaLevel__Level2        = 2,
	ELootQuotaLevel__Level3        = 3,
	ELootQuotaLevel__Level4        = 4,
	ELootQuotaLevel__Level5        = 5,
	ELootQuotaLevel__Level6        = 6,
	ELootQuotaLevel__Level7        = 7,
	ELootQuotaLevel__NumLevels     = 8,
	ELootQuotaLevel__ELootQuotaLevel_MAX = 9,

};

// Enum FortniteGame.EBuildingFoundationType
enum class FortniteGame_EBuildingFoundationType : uint8_t
{
	BFT_3x3                        = 0,
	BFT_5x5                        = 1,
	BFT_5x10                       = 2,
	BFT_None                       = 3,
	BFT_MAX                        = 4,

};

// Enum FortniteGame.ETrackVerticality
enum class FortniteGame_ETrackVerticality : uint8_t
{
	ETrackVerticality__Floor       = 0,
	ETrackVerticality__Stair       = 1,
	ETrackVerticality__Max_None    = 2,
	ETrackVerticality__ETrackVerticality_MAX = 3,

};

// Enum FortniteGame.ETrackIncline
enum class FortniteGame_ETrackIncline : uint8_t
{
	ETrackIncline__Flat            = 0,
	ETrackIncline__Up              = 1,
	ETrackIncline__Down            = 2,
	ETrackIncline__Max_None        = 3,
	ETrackIncline__ETrackIncline_MAX = 4,

};

// Enum FortniteGame.ETrackPieceType
enum class FortniteGame_ETrackPieceType : uint8_t
{
	ETrackPieceType__None          = 0,
	ETrackPieceType__Straight      = 1,
	ETrackPieceType__Turn          = 2,
	ETrackPieceType__Max_None      = 3,
	ETrackPieceType__ETrackPieceType_MAX = 4,

};

// Enum FortniteGame.ETrackDirection
enum class FortniteGame_ETrackDirection : uint8_t
{
	ETrackDirection__Up            = 0,
	ETrackDirection__Right         = 1,
	ETrackDirection__Down          = 2,
	ETrackDirection__Left          = 3,
	ETrackDirection__Max_None      = 4,
	ETrackDirection__ETrackDirection_MAX = 5,

};

// Enum FortniteGame.EFortAbilityTargetSelectionUsage
enum class FortniteGame_EFortAbilityTargetSelectionUsage : uint8_t
{
	EFortAbilityTargetSelectionUsage__BothTargetingAndCanHit = 0,
	EFortAbilityTargetSelectionUsage__OnlyTargeting = 1,
	EFortAbilityTargetSelectionUsage__OnlyCanHit = 2,
	EFortAbilityTargetSelectionUsage__EFortAbilityTargetSelectionUsage_MAX = 3,

};

// Enum FortniteGame.FDynamicBuildOrder
enum class FortniteGame_EFDynamicBuildOrder : uint8_t
{
	FDynamicBuildOrder__X          = 0,
	FDynamicBuildOrder__Y          = 1,
	FDynamicBuildOrder__Z          = 2,
	FDynamicBuildOrder__None       = 3,
	FDynamicBuildOrder__FDynamicBuildOrder_MAX = 4,

};

// Enum FortniteGame.EBinaryToggleValues
enum class FortniteGame_EBinaryToggleValues : uint8_t
{
	BTV_Active                     = 0,
	BTV_Inactive                   = 1,
	BTV_Either                     = 2,
	BTV_MAX                        = 3,

};

// Enum FortniteGame.EAuxIndicatorStates
enum class FortniteGame_EAuxIndicatorStates : uint8_t
{
	AIS_GuidingArrow               = 0,
	AIS_ConfirmedArrow             = 1,
	AIS_Inactive                   = 2,
	AIS_Active                     = 3,
	AIS_MAX                        = 4,

};

// Enum FortniteGame.EColorSwatchType
enum class FortniteGame_EColorSwatchType : uint8_t
{
	EColorSwatchType_Skin          = 0,
	EColorSwatchType_Hair          = 1,
	EColorSwatchType_BodyAccessory = 2,
	EColorSwatchType_Accessory     = 3,
	EColorSwatchType_NumTypes      = 4,
	EColorSwatchType_MAX           = 5,

};

// Enum FortniteGame.ECharacterColorSwatchType
enum class FortniteGame_ECharacterColorSwatchType : uint8_t
{
	ECharacterColorSwatchType_Skin = 0,
	ECharacterColorSwatchType_Hair = 1,
	ECharacterColorSwatchType_NumTypes = 2,
	ECharacterColorSwatchType_MAX  = 3,

};

// Enum FortniteGame.EAccessoryColorName
enum class FortniteGame_EAccessoryColorName : uint8_t
{
	EAccessoryColorName_AccessoryColor1 = 0,
	EAccessoryColorName_AccessoryColor2 = 1,
	EAccessoryColorName_AccessoryColor3 = 2,
	EAccessoryColorName_NumTypes   = 3,
	EAccessoryColorName_MAX        = 4,

};

// Enum FortniteGame.ECustomHatType
enum class FortniteGame_ECustomHatType : uint8_t
{
	ECustomHatType_None            = 0,
	ECustomHatType_Cap             = 1,
	ECustomHatType_Helmet          = 2,
	ECustomHatType_Mask            = 3,
	ECustomHatType_Hat             = 4,
	ECustomHatType_HeadReplacement = 5,
	ECustomHatType_MAX             = 6,

};

// Enum FortniteGame.EClothingColorName
enum class FortniteGame_EClothingColorName : uint8_t
{
	EClothingColorName_AccessoryColor1 = 0,
	EClothingColorName_AccessoryColor2 = 1,
	EClothingColorName_NumTypes    = 2,
	EClothingColorName_MAX         = 3,

};

// Enum FortniteGame.EFortItemPropertyValueType
enum class FortniteGame_EFortItemPropertyValueType : uint8_t
{
	EFortItemPropertyValueType__Float = 0,
	EFortItemPropertyValueType__Integer = 1,
	EFortItemPropertyValueType__Text = 2,
	EFortItemPropertyValueType__Color = 3,
	EFortItemPropertyValueType__TextArray = 4,
	EFortItemPropertyValueType__ImageBrush = 5,
	EFortItemPropertyValueType__EFortItemPropertyValueType_MAX = 6,

};

// Enum FortniteGame.EFortItemPropertyUnit
enum class FortniteGame_EFortItemPropertyUnit : uint8_t
{
	EFortItemPropertyUnit__NoUnit  = 0,
	EFortItemPropertyUnit__TimeSeconds = 1,
	EFortItemPropertyUnit__EFortItemPropertyUnit_MAX = 2,

};

// Enum FortniteGame.EFortItemPropertyDisplay
enum class FortniteGame_EFortItemPropertyDisplay : uint8_t
{
	EFortItemPropertyDisplay__BasicInt = 0,
	EFortItemPropertyDisplay__NegativeImpliesInfiniteInt = 1,
	EFortItemPropertyDisplay__BasicFloat = 2,
	EFortItemPropertyDisplay__NegativeImpliesInfiniteFloat = 3,
	EFortItemPropertyDisplay__BasicString = 4,
	EFortItemPropertyDisplay__NormalizedPercentage = 5,
	EFortItemPropertyDisplay__Color = 6,
	EFortItemPropertyDisplay__StringArray = 7,
	EFortItemPropertyDisplay__SlateBrush = 8,
	EFortItemPropertyDisplay__DoNotDisplay = 9,
	EFortItemPropertyDisplay__EFortItemPropertyDisplay_MAX = 10,

};

// Enum FortniteGame.EFortStatDisplayType
enum class FortniteGame_EFortStatDisplayType : uint8_t
{
	EFortStatDisplayType__Category = 0,
	EFortStatDisplayType__Buff     = 1,
	EFortStatDisplayType__Debuff   = 2,
	EFortStatDisplayType__Neutral  = 3,
	EFortStatDisplayType__DoNotDisplay = 4,
	EFortStatDisplayType__EFortStatDisplayType_MAX = 5,

};

// Enum FortniteGame.EPathUndermineEvent
enum class FortniteGame_EPathUndermineEvent : uint8_t
{
	EPathUndermineEvent__Predicted = 0,
	EPathUndermineEvent__Started   = 1,
	EPathUndermineEvent__Finished  = 2,
	EPathUndermineEvent__EPathUndermineEvent_MAX = 3,

};

// Enum FortniteGame.EPathObstacleAction
enum class FortniteGame_EPathObstacleAction : uint8_t
{
	EPathObstacleAction__Melee     = 0,
	EPathObstacleAction__Ignore    = 1,
	EPathObstacleAction__AbortMoveAsFailed = 2,
	EPathObstacleAction__FinishMoveAsSucceeded = 3,
	EPathObstacleAction__EPathObstacleAction_MAX = 4,

};

// Enum FortniteGame.EFortDirectedMovementSpace
enum class FortniteGame_EFortDirectedMovementSpace : uint8_t
{
	EFortDirectedMovementSpace__WorldSpace = 0,
	EFortDirectedMovementSpace__ActorLocRelative = 1,
	EFortDirectedMovementSpace__ActorLocRotRelative = 2,
	EFortDirectedMovementSpace__CameraRelative = 3,
	EFortDirectedMovementSpace__EFortDirectedMovementSpace_MAX = 4,

};

// Enum FortniteGame.EFortAbilityCostSource
enum class FortniteGame_EFortAbilityCostSource : uint8_t
{
	EFortAbilityCostSource__Stamina = 0,
	EFortAbilityCostSource__Durability = 1,
	EFortAbilityCostSource__AmmoMagazine = 2,
	EFortAbilityCostSource__AmmoPrimary = 3,
	EFortAbilityCostSource__Item   = 4,
	EFortAbilityCostSource__EFortAbilityCostSource_MAX = 5,

};

// Enum FortniteGame.EFortGameplayAbilityActivation
enum class FortniteGame_EFortGameplayAbilityActivation : uint8_t
{
	EFortGameplayAbilityActivation__Passive = 0,
	EFortGameplayAbilityActivation__Triggered = 1,
	EFortGameplayAbilityActivation__Active = 2,
	EFortGameplayAbilityActivation__EFortGameplayAbilityActivation_MAX = 3,

};

// Enum FortniteGame.EFortGameplayAbilityMontageSectionToPlay
enum class FortniteGame_EFortGameplayAbilityMontageSectionToPlay : uint8_t
{
	EFortGameplayAbilityMontageSectionToPlay__FirstSection = 0,
	EFortGameplayAbilityMontageSectionToPlay__RandomSection = 1,
	EFortGameplayAbilityMontageSectionToPlay__TestedRandomSection = 2,
	EFortGameplayAbilityMontageSectionToPlay__EFortGameplayAbilityMontageSectionToPlay_MAX = 3,

};

// Enum FortniteGame.EFortressAIType
enum class FortniteGame_EFortressAIType : uint8_t
{
	FAT_Dormant                    = 0,
	FAT_Cleaner                    = 1,
	FAT_DayWanderer                = 2,
	FAT_NightWanderer              = 3,
	FAT_DebugOnly                  = 4,
	FAT_Encounter                  = 5,
	FAT_MAX                        = 6,

};

// Enum FortniteGame.EFortAILODLevel
enum class FortniteGame_EFortAILODLevel : uint8_t
{
	EFortAILODLevel__Invalid       = 0,
	EFortAILODLevel__Lowest        = 1,
	EFortAILODLevel__Lower         = 2,
	EFortAILODLevel__Normal        = 3,
	EFortAILODLevel__EFortAILODLevel_MAX = 4,

};

// Enum FortniteGame.EWardAffectType
enum class FortniteGame_EWardAffectType : uint8_t
{
	EWardAffectType__AffectsBothStartAndEndPoints = 0,
	EWardAffectType__AffectsOnlyStartPoints = 1,
	EWardAffectType__AffectsOnlyEndPoints = 2,
	EWardAffectType__EWardAffectType_MAX = 3,

};

// Enum FortniteGame.EFortEncounterUtilityDesire
enum class FortniteGame_EFortEncounterUtilityDesire : uint8_t
{
	EFortEncounterUtilityDesire__Low = 0,
	EFortEncounterUtilityDesire__Medium = 1,
	EFortEncounterUtilityDesire__High = 2,
	EFortEncounterUtilityDesire__VeryHigh = 3,
	EFortEncounterUtilityDesire__Max_None = 4,
	EFortEncounterUtilityDesire__EFortEncounterUtilityDesire_MAX = 5,

};

// Enum FortniteGame.EFortAIDirectorFactorContribution
enum class FortniteGame_EFortAIDirectorFactorContribution : uint8_t
{
	EFortAIDirectorFactorContribution__Direct = 0,
	EFortAIDirectorFactorContribution__Inverse = 1,
	EFortAIDirectorFactorContribution__EFortAIDirectorFactorContribution_MAX = 2,

};

// Enum FortniteGame.EFortAIDirectorEventContribution
enum class FortniteGame_EFortAIDirectorEventContribution : uint8_t
{
	EFortAIDirectorEventContribution__Increment = 0,
	EFortAIDirectorEventContribution__Set = 1,
	EFortAIDirectorEventContribution__EFortAIDirectorEventContribution_MAX = 2,

};

// Enum FortniteGame.ETagGoalScoringCategory
enum class FortniteGame_ETagGoalScoringCategory : uint8_t
{
	ETagGoalScoringCategory__Ignore = 0,
	ETagGoalScoringCategory__HighInterest = 1,
	ETagGoalScoringCategory__NumCategories = 2,
	ETagGoalScoringCategory__ETagGoalScoringCategory_MAX = 3,

};

// Enum FortniteGame.EFortIntensityCurveSequenceType
enum class FortniteGame_EFortIntensityCurveSequenceType : uint8_t
{
	EFortIntensityCurveSequenceType__Sequence = 0,
	EFortIntensityCurveSequenceType__Loop = 1,
	EFortIntensityCurveSequenceType__Random = 2,
	EFortIntensityCurveSequenceType__Max_None = 3,
	EFortIntensityCurveSequenceType__EFortIntensityCurveSequenceType_MAX = 4,

};

// Enum FortniteGame.EFortAIWaveProgressSection
enum class FortniteGame_EFortAIWaveProgressSection : uint8_t
{
	EFortAIWaveProgressSection__SectionOne = 0,
	EFortAIWaveProgressSection__SectionTwo = 1,
	EFortAIWaveProgressSection__Max_None = 2,
	EFortAIWaveProgressSection__EFortAIWaveProgressSection_MAX = 3,

};

// Enum FortniteGame.EFortEncounterState
enum class FortniteGame_EFortEncounterState : uint8_t
{
	EFortEncounterState__Uninitialized = 0,
	EFortEncounterState__InitializingProperties = 1,
	EFortEncounterState__InitializingRiftManager = 2,
	EFortEncounterState__AwaitingActivation = 3,
	EFortEncounterState__Active    = 4,
	EFortEncounterState__Max_None  = 5,
	EFortEncounterState__EFortEncounterState_MAX = 6,

};

// Enum FortniteGame.EFortEncounterPacingState
enum class FortniteGame_EFortEncounterPacingState : uint8_t
{
	EFortEncounterPacingState__Ramp = 0,
	EFortEncounterPacingState__Peak = 1,
	EFortEncounterPacingState__Fade = 2,
	EFortEncounterPacingState__Rest = 3,
	EFortEncounterPacingState__Max_None = 4,
	EFortEncounterPacingState__EFortEncounterPacingState_MAX = 5,

};

// Enum FortniteGame.EFortThreatDeactivationType
enum class FortniteGame_EFortThreatDeactivationType : uint8_t
{
	EFortThreatDeactivationType__Off = 0,
	EFortThreatDeactivationType__Dormant = 1,
	EFortThreatDeactivationType__EFortThreatDeactivationType_MAX = 2,

};

// Enum FortniteGame.EFortEncounterSequenceResult
enum class FortniteGame_EFortEncounterSequenceResult : uint8_t
{
	EFortEncounterSequenceResult__Success = 0,
	EFortEncounterSequenceResult__FailedEncounterInProgress = 1,
	EFortEncounterSequenceResult__EFortEncounterSequenceResult_MAX = 2,

};

// Enum FortniteGame.EAssignmentCreationResult
enum class FortniteGame_EAssignmentCreationResult : uint8_t
{
	EAssignmentCreationResult__AssignmentNotFoundOrCreated = 0,
	EAssignmentCreationResult__AssignmentCreated = 1,
	EAssignmentCreationResult__AssignmentFound = 2,
	EAssignmentCreationResult__EAssignmentCreationResult_MAX = 3,

};

// Enum FortniteGame.ECorePerceptionTypes
enum class FortniteGame_ECorePerceptionTypes : uint8_t
{
	ECorePerceptionTypes__Sight    = 0,
	ECorePerceptionTypes__Hearing  = 1,
	ECorePerceptionTypes__Damage   = 2,
	ECorePerceptionTypes__Touch    = 3,
	ECorePerceptionTypes__Team     = 4,
	ECorePerceptionTypes__Prediction = 5,
	ECorePerceptionTypes__MAX      = 6,
	ECorePerceptionTypes__ECorePerceptionTypes_MAX = 7,

};

// Enum FortniteGame.EStatRecordingPeriod
enum class FortniteGame_EStatRecordingPeriod : uint8_t
{
	EStatRecordingPeriod__Minute   = 0,
	EStatRecordingPeriod__Life     = 1,
	EStatRecordingPeriod__Map      = 2,
	EStatRecordingPeriod__Campaign = 3,
	EStatRecordingPeriod__Persistent = 4,
	EStatRecordingPeriod__Max      = 5,
	EStatRecordingPeriod__EStatRecordingPeriod_MAX = 6,

};

// Enum FortniteGame.EStatMod
enum class FortniteGame_EStatMod : uint8_t
{
	EStatMod__Delta                = 0,
	EStatMod__Set                  = 1,
	EStatMod__Maximum              = 2,
	EStatMod__EStatMod_MAX         = 3,

};

// Enum FortniteGame.EMontageInterrupt
enum class FortniteGame_EMontageInterrupt : uint8_t
{
	EMontageInterrupt__Any         = 0,
	EMontageInterrupt__RootMotionOnly = 1,
	EMontageInterrupt__None        = 2,
	EMontageInterrupt__EMontageInterrupt_MAX = 3,

};

// Enum FortniteGame.ETargetDistanceComparisonType
enum class FortniteGame_ETargetDistanceComparisonType : uint8_t
{
	ETargetDistanceComparisonType__TwoDimensions = 0,
	ETargetDistanceComparisonType__ThreeDimensions = 1,
	ETargetDistanceComparisonType__CollisionHalfHeightMultiplier = 2,
	ETargetDistanceComparisonType__ETargetDistanceComparisonType_MAX = 3,

};

// Enum FortniteGame.EFrontEndCamera
enum class FortniteGame_EFrontEndCamera : uint8_t
{
	EFrontEndCamera__Invalid       = 0,
	EFrontEndCamera__HomeBase      = 1,
	EFrontEndCamera__MissionControl = 2,
	EFrontEndCamera__Store         = 3,
	EFrontEndCamera__Vault         = 4,
	EFrontEndCamera__Heroes        = 5,
	EFrontEndCamera__Login         = 6,
	EFrontEndCamera__TutorialPhaseOne = 7,
	EFrontEndCamera__TutorialPhaseTwo = 8,
	EFrontEndCamera__TutorialPhaseThree = 9,
	EFrontEndCamera__HeroSelect    = 10,
	EFrontEndCamera__Party         = 11,
	EFrontEndCamera__WorldMap      = 12,
	EFrontEndCamera__EFrontEndCamera_MAX = 13,

};

// Enum FortniteGame.ECameraOrigin
enum class FortniteGame_ECameraOrigin : uint8_t
{
	ECameraOrigin__ViewTargetTransform = 0,
	ECameraOrigin__BoneTransform   = 1,
	ECameraOrigin__ECameraOrigin_MAX = 2,

};

// Enum FortniteGame.EFortDamageNumberType
enum class FortniteGame_EFortDamageNumberType : uint8_t
{
	EFortDamageNumberType__None    = 0,
	EFortDamageNumberType__Pawn    = 1,
	EFortDamageNumberType__Building = 2,
	EFortDamageNumberType__Player  = 3,
	EFortDamageNumberType__Shield  = 4,
	EFortDamageNumberType__EFortDamageNumberType_MAX = 5,

};

// Enum FortniteGame.EFortEventNotificationParameter
enum class FortniteGame_EFortEventNotificationParameter : uint8_t
{
	EFortEventNotificationParameter__ENPAR_None = 0,
	EFortEventNotificationParameter__ENPAR_SchematicItemGuid = 1,
	EFortEventNotificationParameter__ENPAR_ActionBinding = 2,
	EFortEventNotificationParameter__ENPAR_MAX = 3,

};

// Enum FortniteGame.EFortEventNotificationPriority
enum class FortniteGame_EFortEventNotificationPriority : uint8_t
{
	EFortEventNotificationPriority__ENP_Normal = 0,
	EFortEventNotificationPriority__ENP_High = 1,
	EFortEventNotificationPriority__ENP_MAX = 2,

};

// Enum FortniteGame.EFortServerGameMode
enum class FortniteGame_EFortServerGameMode : uint8_t
{
	EFortServerGameMode__Idle      = 0,
	EFortServerGameMode__LobbyPvE  = 1,
	EFortServerGameMode__LobbyPvP  = 2,
	EFortServerGameMode__ZonePvP   = 3,
	EFortServerGameMode__ZonePvE   = 4,
	EFortServerGameMode__EFortServerGameMode_MAX = 5,

};

// Enum FortniteGame.EFortInputPreset
enum class FortniteGame_EFortInputPreset : uint8_t
{
	EFortInputPreset__Default      = 0,
	EFortInputPreset__Preset1      = 1,
	EFortInputPreset__EFortInputPreset_MAX = 2,

};

// Enum FortniteGame.EFortCharacterCosmetic
enum class FortniteGame_EFortCharacterCosmetic : uint8_t
{
	EFortCharacterCosmetic__Head   = 0,
	EFortCharacterCosmetic__Texture = 1,
	EFortCharacterCosmetic__Color  = 2,
	EFortCharacterCosmetic__Trinket = 3,
	EFortCharacterCosmetic__Face   = 4,
	EFortCharacterCosmetic__Gadget = 5,
	EFortCharacterCosmetic__Body   = 6,
	EFortCharacterCosmetic__ClassFlair = 7,
	EFortCharacterCosmetic__Max_Invalid = 8,
	EFortCharacterCosmetic__EFortCharacterCosmetic_MAX = 9,

};

// Enum FortniteGame.EFortQuestType
enum class FortniteGame_EFortQuestType : uint8_t
{
	EFortQuestType__Task           = 0,
	EFortQuestType__DailyQuest     = 1,
	EFortQuestType__Achievement    = 2,
	EFortQuestType__Onboarding     = 3,
	EFortQuestType__EFortQuestType_MAX = 4,

};

// Enum FortniteGame.ELobbyMissionGeneratorDetailsRequirement
enum class FortniteGame_ELobbyMissionGeneratorDetailsRequirement : uint8_t
{
	ELobbyMissionGeneratorDetailsRequirement__Unknown = 0,
	ELobbyMissionGeneratorDetailsRequirement__NotRequired = 1,
	ELobbyMissionGeneratorDetailsRequirement__Required = 2,
	ELobbyMissionGeneratorDetailsRequirement__ELobbyMissionGeneratorDetailsRequirement_MAX = 3,

};

// Enum FortniteGame.EFortMatchmakingType
enum class FortniteGame_EFortMatchmakingType : uint8_t
{
	EFortMatchmakingType__Gathering = 0,
	EFortMatchmakingType__CriticalMission = 1,
	EFortMatchmakingType__Session  = 2,
	EFortMatchmakingType__EFortMatchmakingType_MAX = 3,

};

// Enum FortniteGame.EFortCheatMissionGenType
enum class FortniteGame_EFortCheatMissionGenType : uint8_t
{
	EFortCheatMissionGenType__NewGeneration = 0,
	EFortCheatMissionGenType__OldGeneration = 1,
	EFortCheatMissionGenType__Max_None = 2,
	EFortCheatMissionGenType__EFortCheatMissionGenType_MAX = 3,

};

// Enum FortniteGame.EPollActorsInVolumeTypes
enum class FortniteGame_EPollActorsInVolumeTypes : uint8_t
{
	EPollActorsInVolumeTypes__DesignerPlacedOnly = 0,
	EPollActorsInVolumeTypes__PlayerBuiltOnly = 1,
	EPollActorsInVolumeTypes__All  = 2,
	EPollActorsInVolumeTypes__EPollActorsInVolumeTypes_MAX = 3,

};

// Enum FortniteGame.EMissionReplyTypes
enum class FortniteGame_EMissionReplyTypes : uint8_t
{
	EMissionReplyTypes__Handled    = 0,
	EMissionReplyTypes__NotHandled = 1,
	EMissionReplyTypes__EMissionReplyTypes_MAX = 2,

};

// Enum FortniteGame.ETimerOverrideSetting
enum class FortniteGame_ETimerOverrideSetting : uint8_t
{
	ETimerOverrideSetting__DefaultBehavior = 0,
	ETimerOverrideSetting__ForceShow = 1,
	ETimerOverrideSetting__ForceHide = 2,
	ETimerOverrideSetting__ETimerOverrideSetting_MAX = 3,

};

// Enum FortniteGame.EMusicChannel
enum class FortniteGame_EMusicChannel : uint8_t
{
	EMusicChannel__A               = 0,
	EMusicChannel__B               = 1,
	EMusicChannel__Stinger         = 2,
	EMusicChannel__Max_None        = 3,
	EMusicChannel__EMusicChannel_MAX = 4,

};

// Enum FortniteGame.EMusicFadeStyles
enum class FortniteGame_EMusicFadeStyles : uint8_t
{
	EMusicFadeStyles__CrossFade    = 0,
	EMusicFadeStyles__FadeOutThenIn = 1,
	EMusicFadeStyles__Max_None     = 2,
	EMusicFadeStyles__EMusicFadeStyles_MAX = 3,

};

// Enum FortniteGame.EFortAreaFlag
enum class FortniteGame_EFortAreaFlag : uint8_t
{
	EFortAreaFlag__Default         = 0,
	EFortAreaFlag__Obstacle        = 1,
	EFortAreaFlag__Smashable       = 2,
	EFortAreaFlag__Unwalkable      = 3,
	EFortAreaFlag__Interactable    = 4,
	EFortAreaFlag__EFortAreaFlag_MAX = 5,

};

// Enum FortniteGame.EFortNavLinkPattern
enum class FortniteGame_EFortNavLinkPattern : uint8_t
{
	EFortNavLinkPattern__Floor     = 0,
	EFortNavLinkPattern__Stairs    = 1,
	EFortNavLinkPattern__Roof      = 2,
	EFortNavLinkPattern__Manual    = 3,
	EFortNavLinkPattern__EFortNavLinkPattern_MAX = 4,

};

// Enum FortniteGame.EFortNamedNavmesh
enum class FortniteGame_EFortNamedNavmesh : uint8_t
{
	EFortNamedNavmesh__Husk        = 0,
	EFortNamedNavmesh__Smasher     = 1,
	EFortNamedNavmesh__MAX         = 2,
	EFortNamedNavmesh__EFortNamedNavmesh_MAX = 3,

};

// Enum FortniteGame.EFortPartyMemberLocation
enum class FortniteGame_EFortPartyMemberLocation : uint8_t
{
	EFortPartyMemberLocation__PreLobby = 0,
	EFortPartyMemberLocation__ConnectingToLobby = 1,
	EFortPartyMemberLocation__Lobby = 2,
	EFortPartyMemberLocation__JoiningGame = 3,
	EFortPartyMemberLocation__InGame = 4,
	EFortPartyMemberLocation__EFortPartyMemberLocation_MAX = 5,

};

// Enum FortniteGame.EFortAnnouncerTeamVocalChords
enum class FortniteGame_EFortAnnouncerTeamVocalChords : uint8_t
{
	EFortAnnouncerTeamVocalChords__Team1 = 0,
	EFortAnnouncerTeamVocalChords__Team2 = 1,
	EFortAnnouncerTeamVocalChords__Max_None = 2,
	EFortAnnouncerTeamVocalChords__EFortAnnouncerTeamVocalChords_MAX = 3,

};

// Enum FortniteGame.EFortContextualReticleTypes
enum class FortniteGame_EFortContextualReticleTypes : uint8_t
{
	FCR_GenericFailure             = 0,
	FCR_Upgrade                    = 1,
	FCR_Repair                     = 2,
	FCR_Locked                     = 3,
	FCR_Placement                  = 4,
	FCR_Edit                       = 5,
	FCR_NoTarget                   = 6,
	FCR_InProgress                 = 7,
	FCR_None                       = 8,
	FCR_MAX                        = 9,

};

// Enum FortniteGame.EFortPointsFromNavGraphGoalPathDistanceFilterOperator
enum class FortniteGame_EFortPointsFromNavGraphGoalPathDistanceFilterOperator : uint8_t
{
	EFortPointsFromNavGraphGoalPathDistanceFilterOperator__AllGoalsInRange = 0,
	EFortPointsFromNavGraphGoalPathDistanceFilterOperator__AnyGoalInRange = 1,
	EFortPointsFromNavGraphGoalPathDistanceFilterOperator__EFortPointsFromNavGraphGoalPathDistanceFilterOperator_MAX = 2,

};

// Enum FortniteGame.EFortTestGoalActorDot
enum class FortniteGame_EFortTestGoalActorDot : uint8_t
{
	EFortTestGoalActorDot__Dot3D   = 0,
	EFortTestGoalActorDot__Dot2D   = 1,
	EFortTestGoalActorDot__EFortTestGoalActorDot_MAX = 2,

};

// Enum FortniteGame.EDistanceMode
enum class FortniteGame_EDistanceMode : uint8_t
{
	EDistanceMode__DistItemToContext = 0,
	EDistanceMode__DistItemGoalActorToContext = 1,
	EDistanceMode__DistItemToItemGoalActor = 2,
	EDistanceMode__EDistanceMode_MAX = 3,

};

// Enum FortniteGame.ECountAIAssignedToType
enum class FortniteGame_ECountAIAssignedToType : uint8_t
{
	ECountAIAssignedToType__Goal   = 0,
	ECountAIAssignedToType__Actor  = 1,
	ECountAIAssignedToType__Assignment = 2,
	ECountAIAssignedToType__ECountAIAssignedToType_MAX = 3,

};

// Enum FortniteGame.EFortScriptedActionEnvironment
enum class FortniteGame_EFortScriptedActionEnvironment : uint8_t
{
	EFortScriptedActionEnvironment__FrontEnd = 0,
	EFortScriptedActionEnvironment__GameServer = 1,
	EFortScriptedActionEnvironment__GameClient = 2,
	EFortScriptedActionEnvironment__Max_None = 3,
	EFortScriptedActionEnvironment__EFortScriptedActionEnvironment_MAX = 4,

};

// Enum FortniteGame.EFortScriptedActionSource
enum class FortniteGame_EFortScriptedActionSource : uint8_t
{
	EFortScriptedActionSource__Quest = 0,
	EFortScriptedActionSource__Token = 1,
	EFortScriptedActionSource__Manual = 2,
	EFortScriptedActionSource__Max_None = 3,
	EFortScriptedActionSource__EFortScriptedActionSource_MAX = 4,

};

// Enum FortniteGame.EFortSocialItemPresenceStatus
enum class FortniteGame_EFortSocialItemPresenceStatus : uint8_t
{
	EFortSocialItemPresenceStatus__Offline = 0,
	EFortSocialItemPresenceStatus__InGame = 1,
	EFortSocialItemPresenceStatus__Away = 2,
	EFortSocialItemPresenceStatus__Unknown = 3,
	EFortSocialItemPresenceStatus__EFortSocialItemPresenceStatus_MAX = 4,

};

// Enum FortniteGame.EFortSocialItemType
enum class FortniteGame_EFortSocialItemType : uint8_t
{
	EFortSocialItemType__Header    = 0,
	EFortSocialItemType__Friend    = 1,
	EFortSocialItemType__PartyInvite = 2,
	EFortSocialItemType__RecentPlayer = 3,
	EFortSocialItemType__Max       = 4,
	EFortSocialItemType__EFortSocialItemType_MAX = 5,

};

// Enum FortniteGame.EFortEventConditionType
enum class FortniteGame_EFortEventConditionType : uint8_t
{
	EFortEventConditionType__EFEC_StatCompare = 0,
	EFortEventConditionType__EFEC_CanCraft = 1,
	EFortEventConditionType__EFEC_MAX = 2,

};

// Enum FortniteGame.EFortCompare
enum class FortniteGame_EFortCompare : uint8_t
{
	EFortCompare__EFC_LessThan     = 0,
	EFortCompare__EFC_LessThanOrEqual = 1,
	EFortCompare__EFC_GreaterThan  = 2,
	EFortCompare__EFC_GreaterThanOrEqual = 3,
	EFortCompare__EFC_Equals       = 4,
	EFortCompare__EFC_MAX          = 5,

};

// Enum FortniteGame.EFortEventRepeat
enum class FortniteGame_EFortEventRepeat : uint8_t
{
	EFortEventRepeat__EFER_Inactive = 0,
	EFortEventRepeat__EFER_Always  = 1,
	EFortEventRepeat__EFER_OncePerPlayer = 2,
	EFortEventRepeat__EFER_OncePerCampaign = 3,
	EFortEventRepeat__EFER_OncePerMap = 4,
	EFortEventRepeat__EFER_MAX     = 5,

};

// Enum FortniteGame.EFortVisibilityBehavior
enum class FortniteGame_EFortVisibilityBehavior : uint8_t
{
	EFortVisibilityBehavior__Proximity = 0,
	EFortVisibilityBehavior__OnceSeenAlwaysSeen = 1,
	EFortVisibilityBehavior__Invalid = 2,
	EFortVisibilityBehavior__EFortVisibilityBehavior_MAX = 3,

};

// Enum FortniteGame.EFortReloadMontageSection
enum class FortniteGame_EFortReloadMontageSection : uint8_t
{
	EFortReloadMontageSection__Intro = 0,
	EFortReloadMontageSection__Loop = 1,
	EFortReloadMontageSection__Outro = 2,
	EFortReloadMontageSection__EFortReloadMontageSection_MAX = 3,

};

// Enum FortniteGame.EFortWorldManagerState
enum class FortniteGame_EFortWorldManagerState : uint8_t
{
	WMS_Created                    = 0,
	WMS_QueryingWorld              = 1,
	WMS_WorldQueryComplete         = 2,
	WMS_CreatingNewWorld           = 3,
	WMS_LoadingExistingWorld       = 4,
	WMS_Running                    = 5,
	WMS_Failed                     = 6,
	WMS_MAX                        = 7,

};

// Enum FortniteGame.EFortLevelStreamingState
enum class FortniteGame_EFortLevelStreamingState : uint8_t
{
	LSS_Unloaded                   = 0,
	LSS_Loaded                     = 1,
	LSS_FoundationsUpdated         = 2,
	LSS_NewActorsCreatedButNotUpdated = 3,
	LSS_AllUpdated                 = 4,
	LSS_Ready                      = 5,
	LSS_MAX                        = 6,

};

// Enum FortniteGame.EFortWorldRecordState
enum class FortniteGame_EFortWorldRecordState : uint8_t
{
	EFortWorldRecordState__StartProcessing = 0,
	EFortWorldRecordState__WaitingForResponse = 1,
	EFortWorldRecordState__RetrievingTheaterInformation = 2,
	EFortWorldRecordState__RetrievingZoneInformation = 3,
	EFortWorldRecordState__RetrievingWorldMetadata = 4,
	EFortWorldRecordState__EnumeratingCloudFiles = 5,
	EFortWorldRecordState__LoadingWorldRecord = 6,
	EFortWorldRecordState__LoadingZoneRecord = 7,
	EFortWorldRecordState__SavingZoneRecord = 8,
	EFortWorldRecordState__SavingWorldRecord = 9,
	EFortWorldRecordState__SavingPlayerProfiles = 10,
	EFortWorldRecordState__Succeeded = 11,
	EFortWorldRecordState__Failed  = 12,
	EFortWorldRecordState__Max_None = 13,
	EFortWorldRecordState__EFortWorldRecordState_MAX = 14,

};

// Enum FortniteGame.EFortWorldRecordAction
enum class FortniteGame_EFortWorldRecordAction : uint8_t
{
	EFortWorldRecordAction__LoadWorldOnly = 0,
	EFortWorldRecordAction__SaveWorldOnly = 1,
	EFortWorldRecordAction__SaveZoneAndWorld = 2,
	EFortWorldRecordAction__LoadZoneAndWorld = 3,
	EFortWorldRecordAction__Max_None = 4,
	EFortWorldRecordAction__EFortWorldRecordAction_MAX = 5,

};

// Enum FortniteGame.EFortZoneType
enum class FortniteGame_EFortZoneType : uint8_t
{
	EFortZoneType__PVE             = 0,
	EFortZoneType__PVP             = 1,
	EFortZoneType__Keep            = 2,
	EFortZoneType__SingleZone      = 3,
	EFortZoneType__Max_None        = 4,
	EFortZoneType__EFortZoneType_MAX = 5,

};

// Enum FortniteGame.EWorkerEmploy
enum class FortniteGame_EWorkerEmploy : uint8_t
{
	EWorkerEmploy__None            = 0,
	EWorkerEmploy__CurrentBuilding = 1,
	EWorkerEmploy__OtherBuilding   = 2,
	EWorkerEmploy__EWorkerEmploy_MAX = 3,

};

// Enum FortniteGame.EMyTownBuildingActorDisplayState
enum class FortniteGame_EMyTownBuildingActorDisplayState : uint8_t
{
	EMyTownBuildingActorDisplayState__Standard = 0,
	EMyTownBuildingActorDisplayState__Custom = 1,
	EMyTownBuildingActorDisplayState__Hidden = 2,
	EMyTownBuildingActorDisplayState__EMyTownBuildingActorDisplayState_MAX = 3,

};

//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct FortniteGame.FortMultiSizeBrush
// 0x02B8
struct FFortMultiSizeBrush
{
	struct FSlateBrush                                 Brush_XXS;                                                 // 0x0000(0x0074) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 Brush_XS;                                                  // 0x0074(0x0074) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 Brush_S;                                                   // 0x00E8(0x0074) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 Brush_M;                                                   // 0x015C(0x0074) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 Brush_L;                                                   // 0x01D0(0x0074) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 Brush_XL;                                                  // 0x0244(0x0074) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortAttributeDetailsInfo
// 0x02E8
struct FFortAttributeDetailsInfo
{
	struct FGameplayTagContainer                       RequiredTags;                                              // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FFortMultiSizeBrush                         Icon;                                                      // 0x0018(0x02B8) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       DisplayName;                                               // 0x02D0(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       Description;                                               // 0x02DC(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortAttributeInfo
// 0x0024
struct FFortAttributeInfo
{
	struct FGameplayAttribute                          Attribute;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortAttributeDisplay>    DisplayMethod;                                             // 0x0004(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JZ9D[0x3];                                     // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       UnitDisplayName;                                           // 0x0008(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FFortAttributeDetailsInfo>           AttributeDetails;                                          // 0x0014(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                               bShowInSummaries;                                          // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bShowInDifferences;                                        // 0x0021(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bNegativeValuesShouldBeDisplayedPositively;                // 0x0022(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_O46J[0x1];                                     // 0x0023(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.GameplayEffectInfo
// 0x0024
struct FGameplayEffectInfo
{
	struct FName                                       Attribute;                                                 // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Magnitude;                                                 // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Operation;                                                 // 0x000C(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Rating;                                                    // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       NumericDescription;                                        // 0x0018(0x0018) ELEMENT_SIZE_MISMATCH (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortWeaponDurabilityByRarityStats
// 0x0028
struct FFortWeaponDurabilityByRarityStats : public FTableRowBase
{
	int                                                Handmade;                                                  // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Ordinary;                                                  // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Sturdy;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Quality;                                                   // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Fine;                                                      // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Elegant;                                                   // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Masterwork;                                                // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Epic;                                                      // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Badass;                                                    // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Legendary;                                                 // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct FortniteGame.FortBaseWeaponStats
// 0x00EC
struct FFortBaseWeaponStats : public FTableRowBase
{
	unsigned char                                      UnknownData_CB7N[0x1];                                     // 0x0000(0x0001) Fix Super Size
	unsigned char                                      UnknownData_8LQ0[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                BaseLevel;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DmgPB;                                                     // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DmgMid;                                                    // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DmgLong;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DmgMaxRange;                                               // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              EnvDmgPB;                                                  // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              EnvDmgMid;                                                 // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              EnvDmgLong;                                                // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              EnvDmgMaxRange;                                            // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RngPB;                                                     // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RngMid;                                                    // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RngLong;                                                   // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RngMax;                                                    // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveTable*                                 DmgScaleTable;                                             // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       DmgScaleTableRow;                                          // 0x003C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DmgScale;                                                  // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveTable*                                 EnvDmgScaleTable;                                          // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       EnvDmgScaleTableRow;                                       // 0x004C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              EnvDmgScale;                                               // 0x0054(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       SurfaceRatioRowName;                                       // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DamageZone_Light;                                          // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DamageZone_Normal;                                         // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DamageZone_Critical;                                       // 0x0068(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DamageZone_Vulnerability;                                  // 0x006C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              KnockbackMagnitude;                                        // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MidRangeKnockbackMagnitude;                                // 0x0074(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              LongRangeKnockbackMagnitude;                               // 0x0078(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              KnockbackZAngle;                                           // 0x007C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ControlStrength;                                           // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MidRangeControlStrength;                                   // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              LongRangeControlStrength;                                  // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              StunTime;                                                  // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              StunScale;                                                 // 0x0090(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                                  Durability;                                                // 0x0094(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       DurabilityRowName;                                         // 0x0098(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DurabilityScale;                                           // 0x00A0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                DurabilityPerUse;                                          // 0x00A4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DurabilityChance;                                          // 0x00A8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DiceCritChance;                                            // 0x00AC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DiceCritDamageMultiplier;                                  // 0x00B0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ReloadTime;                                                // 0x00B4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ReloadScale;                                               // 0x00B8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bReloadIndividualBullets;                                  // 0x00BC(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_BT55[0x3];                                     // 0x00BD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                ClipSize;                                                  // 0x00C0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ClipScale;                                                 // 0x00C4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                InitialClips;                                              // 0x00C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                CartridgePerFire;                                          // 0x00CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                AmmoCostPerFire;                                           // 0x00D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                MaxAmmoCostPerFire;                                        // 0x00D4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MinChargeTime;                                             // 0x00D8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MaxChargeTime;                                             // 0x00DC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ChargeDownTime;                                            // 0x00E0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MinChargeDamageMultiplier;                                 // 0x00E4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MaxChargeDamageMultiplier;                                 // 0x00E8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct FortniteGame.FortTrapStats
// 0x0014 (0x0100 - 0x00EC)
struct FFortTrapStats : public FFortBaseWeaponStats
{
	float                                              ArmTime;                                                   // 0x00EC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FireDelay;                                                 // 0x00F0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamageDelay;                                               // 0x00F4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PlacementScore;                                            // 0x00F8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ActivationScore;                                           // 0x00FC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortRangedWeaponStats
// 0x008C (0x0178 - 0x00EC)
struct FFortRangedWeaponStats : public FFortBaseWeaponStats
{
	float                                              Spread;                                                    // 0x00EC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SpreadDownsights;                                          // 0x00F0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              StandingStillSpreadMultiplier;                             // 0x00F4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HeatX1;                                                    // 0x00F8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HeatY1;                                                    // 0x00FC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HeatX2;                                                    // 0x0100(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HeatY2;                                                    // 0x0104(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HeatX3;                                                    // 0x0108(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HeatY3;                                                    // 0x010C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HeatXScale;                                                // 0x0110(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HeatYScale;                                                // 0x0114(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CoolX1;                                                    // 0x0118(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CoolY1;                                                    // 0x011C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CoolX2;                                                    // 0x0120(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CoolY2;                                                    // 0x0124(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CoolX3;                                                    // 0x0128(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CoolY3;                                                    // 0x012C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CoolXScale;                                                // 0x0130(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CoolYScale;                                                // 0x0134(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BulletsPerCartridge;                                       // 0x0138(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              FiringRate;                                                // 0x013C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ROFScale;                                                  // 0x0140(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              BurstFiringRate;                                           // 0x0144(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RecoilVert;                                                // 0x0148(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RecoilVertScale;                                           // 0x014C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              VertRecoilDownChance;                                      // 0x0150(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RecoilHoriz;                                               // 0x0154(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RecoilHorizScale;                                          // 0x0158(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RecoilInterpSpeed;                                         // 0x015C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RecoilRecoveryInterpSpeed;                                 // 0x0160(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RecoilRecoveryDelay;                                       // 0x0164(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RecoilRecoveryFraction;                                    // 0x0168(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RecoilDownsightsMultiplier;                                // 0x016C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                MaxSpareAmmo;                                              // 0x0170(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BulletsPerTracer;                                          // 0x0174(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct FortniteGame.FortPawnStats
// 0x0030
struct FFortPawnStats : public FTableRowBase
{
	float                                              MaximumHealth;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SpeedWalk;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SpeedRun;                                                  // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SpeedSprint;                                               // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SpeedBackwardsMultiplier;                                  // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveTable*                                 FallingDamageTable;                                        // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       FallingDamageTableRow;                                     // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              KnockbackResistThreshold;                                  // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              KnockbackResistMagScale;                                   // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              StunResistThreshold;                                       // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              StunResistMagScale;                                        // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct FortniteGame.FortMeleeWeaponStats
// 0x0024 (0x0110 - 0x00EC)
struct FFortMeleeWeaponStats : public FFortBaseWeaponStats
{
	float                                              RangeVSEnemies;                                            // 0x00EC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ConeYawAngle;                                              // 0x00F0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ConePitchAngle;                                            // 0x00F4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SwingPlaySpeed;                                            // 0x00F8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              BuildingConeAngle;                                         // 0x00FC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              BuildingConeAnglePitch;                                    // 0x0100(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RangeVSBuildings2D;                                        // 0x0104(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RangeVSBuildingsZ;                                         // 0x0108(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RangeVSWeakSpots;                                          // 0x010C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct FortniteGame.ReplicatedStatValues
// 0x0008
struct FReplicatedStatValues
{
	int                                                StatValue;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ScoreValue;                                                // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortPlayerScoreReport
// 0x0228
struct FFortPlayerScoreReport
{
	TWeakObjectPtr<class AFortPlayerState>             PlayerState;                                               // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FString                                     PlayerName;                                                // 0x0008(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortTeam>                PlayerTeam;                                                // 0x0014(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_655R[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FReplicatedStatValues                       ReplicatedStats_Campaign[0x21];                            // 0x0018(0x0108) (NativeAccessSpecifierPublic)
	struct FReplicatedStatValues                       ReplicatedStats_Zone[0x21];                                // 0x0120(0x0108) (NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.TrackPieceConfig
// 0x0010
struct FTrackPieceConfig
{
	TEnumAsByte<FortniteGame_ETrackPieceType>          Type;                                                      // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9CZT[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FRotator                                    Rotation;                                                  // 0x0004(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.AIHotSpotSlotConfig
// 0x001C
struct FAIHotSpotSlotConfig
{
	struct FVector                                     Offset;                                                    // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     Direction;                                                 // 0x000C(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortHotSpotSlot>         SlotType;                                                  // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_84ZB[0x3];                                     // 0x0019(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.BuildingActorHotSpotDirection
// 0x0018
struct FBuildingActorHotSpotDirection
{
	class UAIHotSpotConfig*                            HotSpotConfig;                                             // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Offset;                                                    // 0x0004(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      bMirrorX : 1;                                              // 0x0010(0x0001) BIT_FIELD (Edit, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      bMirrorY : 1;                                              // 0x0010(0x0001) BIT_FIELD (Edit, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_J1UC[0x3];                                     // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TEnumAsByte<FortniteGame_EFortHotSpotDirection>    Direction;                                                 // 0x0014(0x0001) (Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_F3DC[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortSearchPassParams
// 0x001C
struct FFortSearchPassParams
{
	int                                                ControllerId;                                              // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SessionName;                                               // 0x0004(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     BestDatacenterId;                                          // 0x000C(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_D5C2[0x4];                                     // 0x0018(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortSearchPassState
// 0x001C
struct FFortSearchPassState
{
	int                                                BestSessionIdx;                                            // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     WUIDLockSemaphore;                                         // 0x0004(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bWasCanceled;                                              // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bWasFailure;                                               // 0x0011(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EMatchmakingState>        MatchmakingState;                                          // 0x0012(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<OnlineSubsystemUtils_EPartyReservationResult> LastBeaconResponse;                                        // 0x0013(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YCPT[0x8];                                     // 0x0014(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.MatchmakingParams
// 0x0064
struct FMatchmakingParams
{
	int                                                ControllerId;                                              // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PartySize;                                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     DatacenterId;                                              // 0x0008(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PlaylistId;                                                // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MatchmakingLevel;                                          // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MissionPowerMin;                                           // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MissionPowerMax;                                           // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     TheaterId;                                                 // 0x0024(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ZoneInstanceId;                                            // 0x0030(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     WUID;                                                      // 0x003C(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                            WorldOwnerId;                                              // 0x0048(0x0008) (NativeAccessSpecifierPublic)
	struct FString                                     SessionId;                                                 // 0x0050(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EMatchmakingStartLocation> StartWith;                                                 // 0x005C(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EMatchmakingFlags>        Flags;                                                     // 0x005D(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZVEC[0x2];                                     // 0x005E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              ChanceToHostOverride;                                      // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.GameplayEffectApplicationInfo
// 0x0008
struct FGameplayEffectApplicationInfo
{
	class UClass*                                      GameplayEffect;                                            // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Level;                                                     // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTooltipMapEntry
// 0x0008
struct FFortTooltipMapEntry
{
	class UClass*                                      ObjectClass;                                               // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      TooltipClass;                                              // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortRequirementsInfo
// 0x0020
struct FFortRequirementsInfo
{
	int                                                CommanderLevel;                                            // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PersonalPowerRating;                                       // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PartyPowerRating;                                          // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortQuestItemDefinition*                    QuestDefinition;                                           // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                         ObjectiveStatHandle;                                       // 0x0010(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                         ItemDefinition;                                            // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.HeroItem
// 0x0040
struct FHeroItem
{
	class UFortWorldItemDefinition*                    Item;                                                      // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Quantity;                                                  // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortReplenishmentType>   Replenishment;                                             // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QOTY[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FGameplayTagContainer                       RequiredGPTags;                                            // 0x000C(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       SwapTag;                                                   // 0x0024(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                               bShowInAbilityScreen;                                      // 0x003C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_99M5[0x3];                                     // 0x003D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.HeroAbilityKit
// 0x0020
struct FHeroAbilityKit
{
	class UFortAbilityKit*                             InherentAbilityKit;                                        // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       RequiredGPTags;                                            // 0x0004(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                               bShowInAbilityScreen;                                      // 0x001C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YFBH[0x3];                                     // 0x001D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortAbilityKitSlot
// 0x000C
struct FFortAbilityKitSlot
{
	TArray<class UFortAbilityKit*>                     AbilityKits;                                               // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.AbilityKitItem
// 0x000C
struct FAbilityKitItem
{
	class UFortWorldItemDefinition*                    Item;                                                      // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Quantity;                                                  // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortReplenishmentType>   Replenishment;                                             // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7BHV[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortSavedModeLoadout
// 0x0018
struct FFortSavedModeLoadout
{
	struct FString                                     LoadoutName;                                               // 0x0000(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             SelectedGadgets;                                           // 0x000C(0x000C) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.SelectedClassAbilityKits
// 0x0064
struct FSelectedClassAbilityKits
{
	class UFortAbilityKit*                             AbilityKits[0x19];                                         // 0x0000(0x0064) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.MyTownSubBuildingData
// 0x0004
struct FMyTownSubBuildingData
{
	class UMyTownBuildingDefinitionData*               SubBuilding;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.MyTownBuildingData
// 0x0008
struct FMyTownBuildingData
{
	class UMyTownBuildingDefinitionData*               Building;                                                  // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MapSlotId;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.MyTownRoadData
// 0x0010
struct FMyTownRoadData
{
	struct FName                                       BuildingName1;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       BuildingName2;                                             // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.MyTownWorkerSetBonusData
// 0x0030
struct FMyTownWorkerSetBonusData
{
	struct FGameplayTagContainer                       SetBonusTypeTag;                                           // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       DisplayName;                                               // 0x0018(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int                                                RequiredWorkersCount;                                      // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      SetBonusEffect;                                            // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SelectionWeight;                                           // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.MyTownWorkerPersonalityData
// 0x0028
struct FMyTownWorkerPersonalityData
{
	struct FGameplayTagContainer                       PersonalityTypeTag;                                        // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       PersonalityName;                                           // 0x0018(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int                                                SelectionWeight;                                           // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.MyTownColorBannerData
// 0x0008
struct FMyTownColorBannerData
{
	float                                              Position;                                                  // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                      Color;                                                     // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.MyTownBannerData
// 0x00E8
struct FMyTownBannerData
{
	struct FSlateBrush                                 BigBannerImage;                                            // 0x0000(0x0074) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 SmallBannerImage;                                          // 0x0074(0x0074) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortPublicAccountInfo
// 0x0018
struct FFortPublicAccountInfo
{
	int                                                Level;                                                     // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxLevel;                                                  // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TotalXp;                                                   // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TotalXpForLevel;                                           // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                LevelXp;                                                   // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                LevelXpForLevel;                                           // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortPrivateAccountInfo
// 0x0004 (0x001C - 0x0018)
struct FFortPrivateAccountInfo : public FFortPublicAccountInfo
{
	int                                                MtxBalance;                                                // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortItemQuantityPair
// 0x001C
struct FFortItemQuantityPair
{
	TAssetPtr<class UFortItemDefinition>               ItemDefinition;                                            // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Quantity;                                                  // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortPartyRepState
// 0x0034 (0x003C - 0x0008)
struct FFortPartyRepState : public FPartyState
{
	TEnumAsByte<FortniteGame_EFortPartyState>          PartyProgression;                                          // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bLobbyConnectionStarted;                                   // 0x0009(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EMatchmakingCompleteResult> MatchmakingResult;                                         // 0x000A(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_60WH[0x1];                                     // 0x000B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     SessionId;                                                 // 0x000C(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSessionIsCriticalMission;                                 // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_J09C[0x3];                                     // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                ZoneTileIndex;                                             // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ZoneInstanceId;                                            // 0x0020(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TheaterId;                                                 // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                       TileStates;                                                // 0x0030(0x000C) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.EncounterEnvironmentQueryInfo
// 0x001C
struct FEncounterEnvironmentQueryInfo
{
	class UEnvQuery*                                   EnvironmentQuery;                                          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEnvNamedValue>                      QueryParams;                                               // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KDX8[0x8];                                     // 0x0010(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	bool                                               bIsDirectional;                                            // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7NCD[0x3];                                     // 0x0019(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortEncounterPawnNumberCaps
// 0x0010
struct FFortEncounterPawnNumberCaps
{
	bool                                               bApplyPawnNumberCaps;                                      // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IXK3[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FCurveTableRowHandle>                PawnCapsPerPlayerCount;                                    // 0x0004(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortPersistentGameplayStatValue
// 0x0010
struct FFortPersistentGameplayStatValue
{
	struct FString                                     StatName;                                                  // 0x0000(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                StatValue;                                                 // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortPersistentGameplayStatContainer
// 0x000C
struct FFortPersistentGameplayStatContainer
{
	TArray<struct FFortPersistentGameplayStatValue>    GameplayStats;                                             // 0x0000(0x000C) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortMcpQuestObjectiveInfo
// 0x0040
struct FFortMcpQuestObjectiveInfo
{
	struct FDataTableRowHandle                         ObjectiveStatHandle;                                       // 0x0000(0x000C) (Edit, NativeAccessSpecifierPublic)
	TArray<struct FDataTableRowHandle>                 AlternativeStatHandles;                                    // 0x000C(0x000C) (Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FText                                       Description;                                               // 0x0018(0x0018) ELEMENT_SIZE_MISMATCH (Edit, NativeAccessSpecifierPublic)
	int                                                Count;                                                     // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TAssetPtr<class UClass>                            ScriptedAction;                                            // 0x0028(0x0018) (Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortScriptedActionParams
// 0x0018
struct FFortScriptedActionParams
{
	class AFortPlayerController*                       Player;                                                    // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortScriptedActionSource> SourceType;                                                // 0x0004(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9PG1[0x3];                                     // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UFortItem*                                   SourceItem;                                                // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                         SourceData;                                                // 0x000C(0x000C) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortHomeBaseInfo
// 0x011C
struct FFortHomeBaseInfo
{
	int                                                Rating;                                                    // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PartyRating;                                               // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMyTownBannerData                           Banner;                                                    // 0x0008(0x00E8) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FLinearColor                                Color;                                                     // 0x00F0(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FText                                       Name;                                                      // 0x0100(0x0018) ELEMENT_SIZE_MISMATCH (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<int>                                        Resources;                                                 // 0x010C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                               ValidData;                                                 // 0x0118(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XWDG[0x3];                                     // 0x0119(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.ViewOffsetData
// 0x0024
struct FViewOffsetData
{
	struct FVector                                     OffsetHigh;                                                // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     OffsetMid;                                                 // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     OffsetLow;                                                 // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortEventNotification
// 0x004C
struct FFortEventNotification
{
	struct FName                                       Name;                                                      // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortEventNotificationPriority> NotificationPriority;                                      // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_P1CZ[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      NotificationClass;                                         // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       NotificationTitleText;                                     // 0x0010(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       NotificationText;                                          // 0x001C(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       InputText;                                                 // 0x0028(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FName                                       NotificationActionName;                                    // 0x0034(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortEventNotificationParameter> NotificationParamType;                                     // 0x003C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_091Z[0x3];                                     // 0x003D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              NotificationDuration;                                      // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                                  OptionalNotificationIcon;                                  // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                                  OptionalNotificationSound;                                 // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortFeedbackHandle
// 0x0010
struct FFortFeedbackHandle
{
	class UFortFeedbackBank*                           FeedbackBank;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       EventName;                                                 // 0x0004(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bReadOnly;                                                 // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bBankDefined;                                              // 0x000D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortFeedbackBroadcastFilter> BroadcastFilterOverride;                                   // 0x000E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BJR8[0x1];                                     // 0x000F(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortFeedbackResponse
// 0x0014
struct FFortFeedbackResponse
{
	struct FFortFeedbackHandle                         Handle;                                                    // 0x0000(0x0010) (Edit, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortFeedbackContext>     Context;                                                   // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_86TE[0x3];                                     // 0x0011(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortFeedbackLine
// 0x005C
struct FFortFeedbackLine
{
	TAssetPtr<class USoundBase>                        Audio;                                                     // 0x0000(0x0018) (Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TAssetPtr<class UAnimSequence>                     AnimSequence;                                              // 0x0018(0x0018) (Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TAssetPtr<class UAnimMontage>                      AnimMontage;                                               // 0x0030(0x0018) (Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortFeedbackAddressee>   Addressee;                                                 // 0x0048(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortFeedbackContext>     Context;                                                   // 0x0049(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DJCX[0x2];                                     // 0x004A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FFortFeedbackResponse>               ResponseEvents;                                            // 0x004C(0x000C) (Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                               bInterruptCurrentLine;                                     // 0x0058(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bCanBeInterrupted;                                         // 0x0059(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bCanQue;                                                   // 0x005A(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CMVL[0x1];                                     // 0x005B(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.TrackMovement
// 0x000C
struct FTrackMovement
{
	class USplineComponent*                            CurrentSpline;                                             // 0x0000(0x0004) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DistanceAlongSpline;                                       // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bReverseDirectionAlongSpline;                              // 0x0008(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JDCI[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.RepTrackMovement
// 0x0004 (0x0010 - 0x000C)
struct FRepTrackMovement : public FTrackMovement
{
	float                                              TimeStamp;                                                 // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortUIFeedback
// 0x0018
struct FFortUIFeedback
{
	struct FName                                       Name;                                                      // 0x0000(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                                  Audio;                                                     // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bLooping;                                                  // 0x000C(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_U94L[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              FadeIn;                                                    // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FadeOut;                                                   // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortUIFeedbackBlueprintOnly
// 0x0008 (0x0020 - 0x0018)
struct FFortUIFeedbackBlueprintOnly : public FFortUIFeedback
{
	struct FName                                       EditableName;                                              // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.TrackSplineConfig
// 0x0003
struct FTrackSplineConfig
{
	bool                                               bUseSpline;                                                // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_ETrackDirection>          Start;                                                     // 0x0001(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_ETrackDirection>          End;                                                       // 0x0002(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.TrackSwitchStateConfig
// 0x0028
struct FTrackSwitchStateConfig
{
	struct FTrackPieceConfig                           TrackPiece1;                                               // 0x0000(0x0010) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FTrackPieceConfig                           TrackPiece2;                                               // 0x0010(0x0010) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FTrackSplineConfig                          SplineConfig1;                                             // 0x0020(0x0003) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FTrackSplineConfig                          SplineConfig2;                                             // 0x0023(0x0003) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YYR1[0x2];                                     // 0x0026(0x0002) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.TrackConfiguration
// 0x0030
struct FTrackConfiguration
{
	TArray<bool>                                       NeighborsByDirection;                                      // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FTrackSwitchStateConfig>             SwitchStates;                                              // 0x000C(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FRotator                                    SwitchRotation;                                            // 0x0018(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     SwitchOffset;                                              // 0x0024(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.VisibilityTestPoint
// 0x0010
struct FVisibilityTestPoint
{
	struct FVector                                     Location;                                                  // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                         Component;                                                 // 0x000C(0x0004) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortAbilityCanHitParameters
// 0x0010
struct FFortAbilityCanHitParameters
{
	unsigned char                                      UnknownData_M60O[0x10];                                    // 0x0000(0x0010) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.ContainerStatInfo
// 0x000C
struct FContainerStatInfo
{
	int                                                NumSpawned;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumSearched;                                               // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumDestroyedWithoutSearch;                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.NpcStatInfo
// 0x0010
struct FNpcStatInfo
{
	int                                                NumSpawned;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumKilled;                                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumDespawnedNormally;                                      // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumDespawnedDueToInactivity;                               // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortGameplayEffectModifierDescription
// 0x0018
struct FFortGameplayEffectModifierDescription
{
	struct FGameplayAttribute                          ModAttribute;                                              // 0x0000(0x0004) (NativeAccessSpecifierPublic)
	struct FText                                       ModDescription;                                            // 0x0004(0x0018) ELEMENT_SIZE_MISMATCH (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                               bIsBuff;                                                   // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortAttributeDisplay>    MagnitudeFormat;                                           // 0x0011(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortStatDisplayType>     DisplayType;                                               // 0x0012(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MAPZ[0x1];                                     // 0x0013(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Magnitude;                                                 // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.DamagerInfoAnalytics
// 0x0010
struct FDamagerInfoAnalytics
{
	struct FString                                     DamageCauser;                                              // 0x0000(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DamageAmount;                                              // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortAIPawnStats
// 0x0180 (0x01B0 - 0x0030)
struct FFortAIPawnStats : public FFortPawnStats
{
	float                                              MinProximityNotifyDistXY;                                  // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ProximityNotifyDistXY;                                     // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ProximityNotifyDistZ;                                      // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bCanOpenDoors;                                             // 0x003C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                               bStopOnMelee;                                              // 0x003D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                               bPauseAfterMelee;                                          // 0x003E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                               bPerformMeleeLungeAttacks;                                 // 0x003F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                              HostilityAdjustmentDeathFixed;                             // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HostilityAdjustmentDeathScaled;                            // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                ScoreValue;                                                // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DormantSightRadius;                                        // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DormantHearingThreshold;                                   // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DormantLOSHearingThreshold;                                // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DormantPeripheralVisionAngle;                              // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DormantNightAlwaysSenseRadius;                             // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              AlertSightRadius;                                          // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              AlertHearingThreshold;                                     // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              AlertLOSHearingThreshold;                                  // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              AlertPeripheralVisionAngle;                                // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              AutoSuccessRangeFromLastSeenLocation;                      // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SuicideDamage;                                             // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ShortRange;                                                // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MediumRange;                                               // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              LongRange;                                                 // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveTable*                                 HealthScalingTable;                                        // 0x0084(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       HealthScalingTableRow;                                     // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat1;                                            // 0x0090(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat1;                                             // 0x0094(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat2;                                            // 0x00A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat2;                                             // 0x00A4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat3;                                            // 0x00B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat3;                                             // 0x00B4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat4;                                            // 0x00C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat4;                                             // 0x00C4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat5;                                            // 0x00D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat5;                                             // 0x00D4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat6;                                            // 0x00E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat6;                                             // 0x00E4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat7;                                            // 0x00F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat7;                                             // 0x00F4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat8;                                            // 0x0100(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat8;                                             // 0x0104(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat9;                                            // 0x0110(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat9;                                             // 0x0114(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat10;                                           // 0x0120(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat10;                                            // 0x0124(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat11;                                           // 0x0130(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat11;                                            // 0x0134(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat12;                                           // 0x0140(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat12;                                            // 0x0144(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat13;                                           // 0x0150(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat13;                                            // 0x0154(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat14;                                           // 0x0160(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat14;                                            // 0x0164(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat15;                                           // 0x0170(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat15;                                            // 0x0174(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              WildcardFloat16;                                           // 0x0180(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentFloat16;                                            // 0x0184(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                WildcardInt1;                                              // 0x0190(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentInt1;                                               // 0x0194(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                WildcardInt2;                                              // 0x01A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FString                                     CommentInt2;                                               // 0x01A4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct FortniteGame.RunVariationData
// 0x000C
struct FRunVariationData
{
	TWeakObjectPtr<class AFortAIPawn>                  FortAIPawn;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                              Distance;                                                  // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortEncounterAIDirectorFactor
// 0x000C
struct FFortEncounterAIDirectorFactor
{
	float                                              CurrentValue;                                              // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AccumulatedPeriodValue;                                    // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TotalPeriodTime;                                           // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortIntensityCurve
// 0x0020
struct FFortIntensityCurve : public FTableRowBase
{
	class UCurveTable*                                 IntensityCurveTable;                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       IntensityCurveTableRow;                                    // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              LowPlayerPerformancePeakIntensityThreshold;                // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              NormalPlayerPerformancePeakIntensityThreshold;             // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              HighPlayerPerformancePeakIntensityThreshold;               // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MaxRampTime;                                               // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              FadeEndIntensityThreshold;                                 // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct FortniteGame.FortSpawnPointsPercentageCurve
// 0x0010
struct FFortSpawnPointsPercentageCurve : public FTableRowBase
{
	class UCurveTable*                                 SpawnPointsPercentageCurveTable;                           // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       SpawnPointsPercentageCurveTableRow;                        // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MaxRampTime;                                               // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct FortniteGame.FortEncounterSettings
// 0x0030
struct FFortEncounterSettings
{
	TArray<TEnumAsByte<FortniteGame_EFortEncounterDirection>> ForbiddenSpawnDirections;                                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                               bRiftsDestroyPlayerBuiltBuildings;                         // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bMustFindSpawnPoints;                                      // 0x000D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6DXO[0x2];                                     // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                NumRiftsToUseOverride;                                     // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEnvQuery*                                   RiftSelectionQuery;                                        // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                              ScriptedSpawnPoints;                                       // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                              WorkingScriptedSpawnPoints;                                // 0x0024(0x000C) (ZeroConstructor, Transient, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortAIEncounterRiftManagerInitializationData
// 0x0078
struct FFortAIEncounterRiftManagerInitializationData
{
	class UFortAIEncounterInfo*                        EncounterInfo;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortEncounterSettings                      EncounterSettings;                                         // 0x0004(0x0030) (NativeAccessSpecifierPublic)
	struct FEncounterEnvironmentQueryInfo              CurrentEnvironmentQueryInfo;                               // 0x0034(0x001C) (NativeAccessSpecifierPublic)
	struct FEncounterEnvironmentQueryInfo              FallbackEnvironmentQueryInfo;                              // 0x0050(0x001C) (NativeAccessSpecifierPublic)
	class UClass*                                      RiftClassTemplate;                                         // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumRiftsToUse;                                             // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MinRiftsToUse;                                             // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortAIGoalInfo
// 0x0018
struct FFortAIGoalInfo
{
	TWeakObjectPtr<class AActor>                       Actor;                                                     // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FVector                                     Location;                                                  // 0x0008(0x000C) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                               bActorAlwaysPerceived;                                     // 0x0014(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                               bAllowsUndermining;                                        // 0x0015(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_4T07[0x2];                                     // 0x0016(0x0002) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.AIAssignmentInfo
// 0x0070
struct FAIAssignmentInfo
{
	TWeakObjectPtr<class UFortAIAssignment>            CurrentAssignment;                                         // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FFortAIGoalInfo                             CurrentGoal;                                               // 0x0008(0x0018) (NativeAccessSpecifierPrivate)
	float                                              TimeCurrentGoalWasChosen;                                  // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              TimeExitedLastAssignmentOfType[0x4];                       // 0x0024(0x0010) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFortAIAssignment>            PreviousAssignment;                                        // 0x0034(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FFortAIGoalInfo                             PreviousGoal;                                              // 0x003C(0x0018) (NativeAccessSpecifierPrivate)
	bool                                               bWaitingForQueryResponse;                                  // 0x0054(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                               bSuppressGoalUpdates;                                      // 0x0055(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_5BO1[0x1A];                                    // 0x0056(0x001A) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.AIDiscouragedGoalTimer
// 0x0024
struct FAIDiscouragedGoalTimer
{
	struct FFortAIGoalInfo                             DiscouragedGoalInfo;                                       // 0x0000(0x0018) (NativeAccessSpecifierPublic)
	double                                             ExpirationTime;                                            // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           NumberOfTimesMarkedForDiscouragement;                      // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortVariantSpawnPoints
// 0x0004
struct FFortVariantSpawnPoints : public FTableRowBase
{
	int                                                BudgetPoints;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.ScoreMultiplierRow
// 0x007C
struct FScoreMultiplierRow : public FTableRowBase
{
	float                                              CombatMultiplier;                                          // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              BuildingMultiplier;                                        // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              UtilityMultiplier;                                         // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              BadgeMultiplier;                                           // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                MonsterKills;                                              // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                MonsterDamagePoints;                                       // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                PlayerKills;                                               // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                WoodGathered;                                              // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                StoneGathered;                                             // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                MetalGathered;                                             // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Deaths;                                                    // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsBuilt;                                            // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsBuilt_Wood;                                       // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsBuilt_Stone;                                      // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsBuilt_Metal;                                      // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsUpgraded_Wood2;                                   // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsUpgraded_Wood3;                                   // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsUpgraded_Stone2;                                  // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsUpgraded_Stone3;                                  // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsUpgraded_Metal2;                                  // 0x004C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsUpgraded_Metal3;                                  // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                BuildingsDestroyed;                                        // 0x0054(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Repair_Wood;                                               // 0x0058(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Repair_Stone;                                              // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Repair_Metal;                                              // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                FlagsCaptured;                                             // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                FlagsReturned;                                             // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                ContainersLooted;                                          // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                CraftingPoints;                                            // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                TrapPlacementPoints;                                       // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                TrapActivationPoints;                                      // 0x0078(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct FortniteGame.WorldItemAndMinMaxCount
// 0x001C
struct FWorldItemAndMinMaxCount
{
	struct FCurveTableRowHandle                        MinCurveTable;                                             // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FCurveTableRowHandle                        MaxCurveTable;                                             // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UFortWorldItemDefinition*                    Item;                                                      // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.ItemAndCount
// 0x0008
struct FItemAndCount
{
	int                                                Count;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                         Item;                                                      // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTraitCostData
// 0x0014
struct FFortTraitCostData : public FTableRowBase
{
	int                                                One;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Two;                                                       // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Three;                                                     // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Four;                                                      // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Five;                                                      // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortLevelUpData
// 0x001C
struct FFortLevelUpData : public FTableRowBase
{
	int                                                XP;                                                        // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ItemRewardsText;                                           // 0x0004(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     MaximumXPMultBonusTier;                                    // 0x0010(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.PowerPointCalculationData
// 0x0024
struct FPowerPointCalculationData : public FTableRowBase
{
	float                                              HeroBasePowerPoints;                                       // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PowerPointsPerDifficultyPoint;                             // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxHealthPerPowerPoint;                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxStaminaPerPowerPoint;                                   // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RunSpeedPerPowerPoint;                                     // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SprintSpeedPerPowerPoint;                                  // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamagePerPowerPoint;                                       // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FakeHeroDamagePowerPointValue;                             // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              WeaponPPPerOtherPP;                                        // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.PlayerBuildableClassFilter
// 0x000C
struct FPlayerBuildableClassFilter
{
	TEnumAsByte<FortniteGame_EFortResourceType>        ResourceType;                                              // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortBuildingType>        BuildingType;                                              // 0x0001(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_RVI8[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                Level;                                                     // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBuildingEditModeMetadata*                   EditModeMetadata;                                          // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortHealthBarComponentData
// 0x000C
struct FFortHealthBarComponentData
{
	struct FText                                       DisplayText;                                               // 0x0000(0x0018) ELEMENT_SIZE_MISMATCH (NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.HomebaseBuildingDataTableRow
// 0x0058
struct FHomebaseBuildingDataTableRow : public FTableRowBase
{
	int                                                MinRating;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Attribute;                                                 // 0x0004(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Operation;                                                 // 0x000C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Magnitude;                                                 // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RequiredSourceTags;                                        // 0x0018(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RequiredTargetTags;                                        // 0x0024(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ApplicationRequiredTags;                                   // 0x0030(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveTable*                                 MagnitudeDataTable;                                        // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       MagnitudeCategory;                                         // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PowerPointValue;                                           // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     PowerPointClassTagFilter;                                  // 0x004C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.HomebaseBuildingStaticDataTableRow
// 0x0074
struct FHomebaseBuildingStaticDataTableRow : public FTableRowBase
{
	struct FName                                       BuildingName;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                BuildingLevel;                                             // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Attribute;                                                 // 0x000C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Operation;                                                 // 0x0014(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Magnitude;                                                 // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ApplicationRequiredTags;                                   // 0x0020(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RequiredSourceTags;                                        // 0x002C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RequiredTargetTags;                                        // 0x0038(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       MagnitudeAttribute;                                        // 0x0044(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveTable*                                 MagnitudeDataTable;                                        // 0x004C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       MagnitudeCategory;                                         // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     GrantedTags;                                               // 0x0058(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PowerPointValue;                                           // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     PowerPointClassTagFilter;                                  // 0x0068(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortBadgeScoringData
// 0x0008
struct FFortBadgeScoringData : public FTableRowBase
{
	int                                                ScoreAwarded;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MissionPoints;                                             // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortLootLevelData
// 0x0014
struct FFortLootLevelData : public FTableRowBase
{
	struct FName                                       Category;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                LootLevel;                                                 // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MinItemLevel;                                              // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxItemLevel;                                              // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortLootPackageData
// 0x0064
struct FFortLootPackageData : public FTableRowBase
{
	struct FName                                       LootPackageID;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Weight;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Count;                                                     // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                LootPackageCategory;                                       // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       RequiredTag;                                               // 0x0014(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     LootPackageCall;                                           // 0x001C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TAssetPtr<class UFortItemDefinition>               ItemDefinition;                                            // 0x0028(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     PersistentLevel;                                           // 0x0040(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MinWorldLevel;                                             // 0x004C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxWorldLevel;                                             // 0x0050(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAllowBonusDrops;                                          // 0x0054(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KA2J[0x3];                                     // 0x0055(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     Annotation;                                                // 0x0058(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortLootTierData
// 0x007C
struct FFortLootTierData : public FTableRowBase
{
	struct FName                                       TierGroup;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Weight;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_ELootQuotaLevel>          QuotaLevel;                                                // 0x000C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QPB5[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                LootTier;                                                  // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MinWorldLevel;                                             // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxWorldLevel;                                             // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     StreakBreakerCurrency;                                     // 0x001C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                StreakBreakerPointsMin;                                    // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                StreakBreakerPointsMax;                                    // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                StreakBreakerPointsSpend;                                  // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       RequiredTag;                                               // 0x0034(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       LootPackage;                                               // 0x003C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       LootPreviewPackage;                                        // 0x0044(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              NumLootPackageDrops;                                       // 0x004C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveTable*                                 LootPackageCategoryData;                                   // 0x0050(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       LootPackageCategoryWeightRowName;                          // 0x0054(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       LootPackageCategoryMinRowName;                             // 0x005C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       LootPackageCategoryMaxRowName;                             // 0x0064(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAllowBonusLootDrops;                                      // 0x006C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_58H7[0x3];                                     // 0x006D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     Annotation;                                                // 0x0070(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.QueuedMusic
// 0x000C
struct FQueuedMusic
{
	unsigned char                                      UnknownData_QQXU[0xC];                                     // 0x0000(0x000C) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.OutpostCraftingTableData
// 0x0014
struct FOutpostCraftingTableData : public FTableRowBase
{
	int                                                Level;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ItemCount;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RequiredItems;                                             // 0x0008(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.OutpostDisintegrationData
// 0x001C
struct FOutpostDisintegrationData : public FTableRowBase
{
	TAssetPtr<class UFortWorldItemDefinition>          ItemDefinition;                                            // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DisintegrationValue;                                       // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.OutpostItemUpgradeData
// 0x0034
struct FOutpostItemUpgradeData : public FTableRowBase
{
	TAssetPtr<class UFortOutpostItemDefinition>        ItemDefinition;                                            // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ItemLevel;                                                 // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RequiredItems;                                             // 0x001C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RequiredAccountItems;                                      // 0x0028(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.TransparentActorInfo
// 0x000C
struct FTransparentActorInfo
{
	unsigned char                                      UnknownData_KNZV[0xC];                                     // 0x0000(0x000C) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortDestroyedActorRecord
// 0x0050
struct FFortDestroyedActorRecord
{
	struct FGuid                                       ActorGuid;                                                 // 0x0000(0x0010) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UClass*                                      ActorClass;                                                // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_E53T[0xC];                                     // 0x0014(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTransform                                  ActorTransform;                                            // 0x0020(0x0030) (IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortBuildingActorArray
// 0x000C
struct FFortBuildingActorArray
{
	TArray<struct FFortDestroyedActorRecord>           ActorRecords;                                              // 0x0000(0x000C) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTaggedActorOctreeFilter
// 0x0040
struct FFortTaggedActorOctreeFilter
{
	struct FBoxSphereBounds                            Bounds;                                                    // 0x0000(0x001C) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                              MinDistanceFromBoundsCenter;                               // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      OptionalSubclass;                                          // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       TagsToLookFor;                                             // 0x0024(0x0018) (NativeAccessSpecifierPublic)
	bool                                               bHasAllTags;                                               // 0x003C(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_98QF[0x3];                                     // 0x003D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortMissionInfoTagRequirementReplacement
// 0x003C
struct FFortMissionInfoTagRequirementReplacement
{
	unsigned char                                      UnknownData_UFNB[0x3C];                                    // 0x0000(0x003C) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.VelocityGridStrokeData
// 0x0001
struct FVelocityGridStrokeData
{
	unsigned char                                      UnknownData_KYF1[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.VelocityGridStrokeSubData
// 0x0001
struct FVelocityGridStrokeSubData
{
	unsigned char                                      UnknownData_RGTJ[0x1];                                     // 0x0000(0x0001) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.TileLootQuota
// 0x000C
struct FTileLootQuota : public FTableRowBase
{
	int                                                Min;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Max;                                                       // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Quota;                                                     // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.LootQuota
// 0x0004 (0x0010 - 0x000C)
struct FLootQuota : public FTileLootQuota
{
	TEnumAsByte<FortniteGame_ELootQuotaLevel>          QuotaLevel;                                                // 0x000C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_H4CN[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortTeamMemberInfo
// 0x01E8
struct FFortTeamMemberInfo
{
	struct FUniqueNetIdRepl                            MemberUniqueId;                                            // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                            PartyLeaderUniqueId;                                       // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       PlayerName;                                                // 0x0010(0x0018) ELEMENT_SIZE_MISMATCH (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                               bPartyLeader;                                              // 0x001C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bIsInZone;                                                 // 0x001D(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_T855[0x2];                                     // 0x001E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                NumPlayersInParty;                                         // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PlayerIndex;                                               // 0x0024(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortTeam>                TeamAffiliation;                                           // 0x0028(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8J9Q[0x3];                                     // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       HeroClass;                                                 // 0x002C(0x0018) ELEMENT_SIZE_MISMATCH (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       HeroLevel;                                                 // 0x0038(0x0018) ELEMENT_SIZE_MISMATCH (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int                                                HeroXP;                                                    // 0x0044(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                                   HeroItem;                                                  // 0x0048(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFortItem*>                           SelectedGadgetItems;                                       // 0x004C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 HeroIcon;                                                  // 0x0058(0x0074) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FFortHomeBaseInfo                           HomeBaseInfo;                                              // 0x00CC(0x011C) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortQuestObjectiveStatTableRow
// 0x0074
struct FFortQuestObjectiveStatTableRow : public FTableRowBase
{
	TEnumAsByte<FortniteGame_EFortQuestObjectiveType>  Type;                                                      // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ARQC[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     TargetTags;                                                // 0x0004(0x000C) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     SourceTags;                                                // 0x0010(0x000C) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ContextTags;                                               // 0x001C(0x000C) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       TargetTagContainer;                                        // 0x0028(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       SourceTagContainer;                                        // 0x0040(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       ContextTagContainer;                                       // 0x0058(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	int                                                IntParameter;                                              // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortMissionInstancedConfigDataBucket
// 0x000C
struct FFortMissionInstancedConfigDataBucket
{
	struct FGameplayTag                                Tag;                                                       // 0x0000(0x0008) (Transient, NativeAccessSpecifierPublic)
	class UFortMissionConfigData*                      ConfigData;                                                // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortMissionInstancedConfigData
// 0x000C
struct FFortMissionInstancedConfigData
{
	TArray<struct FFortMissionInstancedConfigDataBucket> ConfigDataBuckets;                                         // 0x0000(0x000C) (ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

};

// ScriptStruct FortniteGame.FortQuestReward
// 0x0008
struct FFortQuestReward
{
	class UFortItem*                                   Item;                                                      // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Quantity;                                                  // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortQuestObjectiveCompletion
// 0x0014
struct FFortQuestObjectiveCompletion
{
	struct FString                                     StatName;                                                  // 0x0000(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortQuestObjectiveType>  ObjectiveType;                                             // 0x000C(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZKWE[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                Count;                                                     // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.QuickBarSlotData
// 0x0028
struct FQuickBarSlotData
{
	TArray<TEnumAsByte<FortniteGame_EFortItemType>>    AcceptedItemTypes;                                         // 0x0000(0x000C) (Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                               bStaticSlot;                                               // 0x000C(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XXWF[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TAssetPtr<class UFortWorldItemDefinition>          DefaultItem;                                               // 0x0010(0x0018) (Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTheaterMissionWeight
// 0x001C
struct FFortTheaterMissionWeight
{
	TAssetPtr<class UClass>                            MissionGenerator;                                          // 0x0000(0x0018) (Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Weight;                                                    // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTheaterDifficultyWeight
// 0x001C
struct FFortTheaterDifficultyWeight
{
	struct FDataTableRowHandle                         DifficultyInfo;                                            // 0x0000(0x000C) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FString                                     LootTierGroup;                                             // 0x000C(0x000C) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Weight;                                                    // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTheaterMapMissionData
// 0x0024
struct FFortTheaterMapMissionData
{
	TArray<struct FFortTheaterMissionWeight>           MissionWeights;                                            // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FFortTheaterDifficultyWeight>        DifficultyWeights;                                         // 0x000C(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int                                                NumMissionsAvailable;                                      // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumMissionsToChange;                                       // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MissionChangeFrequency;                                    // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTheaterMapTileData
// 0x005C
struct FFortTheaterMapTileData
{
	TEnumAsByte<FortniteGame_EFortTheaterMapTileType>  TileType;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_4D8D[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TAssetPtr<class UClass>                            ZoneTheme;                                                 // 0x0004(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortRequirementsInfo                       Requirements;                                              // 0x001C(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int                                                XCoordinate;                                               // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                YCoordinate;                                               // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortTheaterMissionWeight>           MissionWeightOverrides;                                    // 0x0044(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortTheaterDifficultyWeight>        DifficultyWeightOverrides;                                 // 0x0050(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTheaterMapRegionData
// 0x008C
struct FFortTheaterMapRegionData
{
	struct FText                                       DisplayName;                                               // 0x0000(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       RegionTags;                                                // 0x000C(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	TArray<int>                                        TileIndices;                                               // 0x0024(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	TAssetPtr<class USlateBrushAsset>                  RegionThemeIcon;                                           // 0x0030(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortTheaterMapMissionData                  MissionData;                                               // 0x0048(0x0024) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortRequirementsInfo                       Requirements;                                              // 0x006C(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTheaterColorInfo
// 0x0020
struct FFortTheaterColorInfo
{
	bool                                               bUseDifficultyToDetermineColor;                            // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_E58E[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSlateColor                                 Color;                                                     // 0x0004(0x001C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTheaterRuntimeData
// 0x008C
struct FFortTheaterRuntimeData
{
	TEnumAsByte<FortniteGame_EFortTheaterType>         TheaterType;                                               // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VBMB[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FGameplayTagContainer                       TheaterTags;                                               // 0x0004(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortRequirementsInfo                       TheaterVisibilityRequirements;                             // 0x001C(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortRequirementsInfo                       Requirements;                                              // 0x003C(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UClass*                                      WorldMapPinClass;                                          // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                                  TheaterImage;                                              // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortTheaterColorInfo                       TheaterColorInfo;                                          // 0x0064(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FName                                       Socket;                                                    // 0x0084(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTheaterMapData
// 0x00D0
struct FFortTheaterMapData
{
	struct FText                                       DisplayName;                                               // 0x0000(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FString                                     UniqueId;                                                  // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TheaterSlot;                                               // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsTestTheater;                                            // 0x001C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BTY7[0x3];                                     // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       Description;                                               // 0x0020(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortTheaterRuntimeData                     RuntimeInfo;                                               // 0x002C(0x008C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FFortTheaterMapTileData>             Tiles;                                                     // 0x00B8(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FFortTheaterMapRegionData>           Regions;                                                   // 0x00C4(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortTheaterTileEditorData
// 0x004C
struct FFortTheaterTileEditorData
{
	int                                                XCoordinate;                                               // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                YCoordinate;                                               // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      ZoneTheme;                                                 // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortRegionInfo*                             Region;                                                    // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortRequirementsInfo                       Requirements;                                              // 0x0010(0x0020) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortTheaterMapTileType>  TileType;                                                  // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FUOZ[0x3];                                     // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FFortTheaterMissionWeight>           MissionWeightOverrides;                                    // 0x0034(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FFortTheaterDifficultyWeight>        DifficultyWeightOverrides;                                 // 0x0040(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortPlacementActorFinderEntry
// 0x0068
struct FFortPlacementActorFinderEntry
{
	TAssetPtr<class UClass>                            BuildingToSpawn;                                           // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       RequiredTags;                                              // 0x0018(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       PreferredTags;                                             // 0x0030(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       ExlusionTags;                                              // 0x0048(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UClass*                                      BuildingClassToReplace;                                    // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIgnoreCollisionCheck;                                     // 0x0064(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bSnapToGrid;                                               // 0x0065(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9K5K[0x2];                                     // 0x0066(0x0002) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortPlacementActorFinderInfo
// 0x0014
struct FFortPlacementActorFinderInfo
{
	float                                              DistanceRangeMin;                                          // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DistanceRangeMax;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortPlacementActorFinderEntry>      BuildingData;                                              // 0x0008(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortMissionEvent
// 0x006C
struct FFortMissionEvent
{
	struct FName                                       EventType;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       ObjectiveHandle;                                           // 0x0008(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UObject*                                     EventFocus;                                                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataAsset*                                  EventContent;                                              // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      EventInstigator;                                           // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                GenericInt;                                                // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              GenericFloat;                                              // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       GenericText;                                               // 0x0034(0x0018) ELEMENT_SIZE_MISMATCH (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       GameplayTags;                                              // 0x0040(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGuid                                       MissionGuid;                                               // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UFortMissionEventParams*                     Params;                                                    // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.AIDirectorDebugInfo
// 0x0020
struct FAIDirectorDebugInfo
{
	float                                              TimeStamp;                                                 // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                      DebugGraphData;                                            // 0x0004(0x000C) (ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EN0S[0x10];                                    // 0x0010(0x0010) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.LastBuildableState
// 0x000C
struct FLastBuildableState
{
	class UBuildingEditModeMetadata*                   LastBuildableMetaData;                                     // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               LastBuildableMirrored;                                     // 0x0004(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1JK3[0x3];                                     // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                LastBuildableRotationIterations;                           // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.RecentDamagedBuildingInfo
// 0x0010
struct FRecentDamagedBuildingInfo
{
	TWeakObjectPtr<class ABuildingSMActor>             Building;                                                  // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                              LastDamagedTime;                                           // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              UndistributedResources;                                    // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortDamageNumberInfo
// 0x0058
struct FFortDamageNumberInfo
{
	struct FVector                                     WorldLocation;                                             // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     HitNormal;                                                 // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bIsCriticalDamage;                                         // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DHNK[0x3];                                     // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                Damage;                                                    // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortDamageNumberType>    DamageNumberType;                                          // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IJD9[0x3];                                     // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              VisualDamageScale;                                         // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<FortniteGame_EFortElementalDamageType> ElementalDamageType;                                       // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_T812[0x3];                                     // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UStaticMeshComponent*                        StaticMeshComponent;                                       // 0x002C(0x0004) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>            MeshMIDs;                                                  // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int>                                        DamageNumberArray;                                         // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                       DamagedActor;                                              // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class APawn>                        DamageCauser;                                              // 0x0050(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortAdvancementInfo
// 0x0020
struct FFortAdvancementInfo
{
	struct FString                                     TemplateName;                                              // 0x0000(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     InstanceId;                                                // 0x000C(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Level;                                                     // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                XP;                                                        // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct FortniteGame.FortGiftingInfo
// 0x0018
struct FFortGiftingInfo
{
	struct FString                                     PlayerName;                                                // 0x0000(0x000C) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortHeroType*                               HeroType;                                                  // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_3K5V[0x8];                                     // 0x0010(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortItemEntryStateValue
// 0x0010
struct FFortItemEntryStateValue
{
	int                                                IntValue;                                                  // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FName                                       NameValue;                                                 // 0x0004(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TEnumAsByte<FortniteGame_EFortItemEntryState>      StateType;                                                 // 0x000C(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_7LVI[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct FortniteGame.FortItemEntry
// 0x0070 (0x007C - 0x000C)
struct FFortItemEntry : public FFastArraySerializerItem
{
	int                                                Count;                                                     // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDefinition*                         ItemDefinition;                                            // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              Durability;                                                // 0x0014(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                Level;                                                     // 0x0018(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                LoadedAmmo;                                                // 0x001C(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortAlterationItemDefinition*>       AlterationDefinitions;                                     // 0x0020(0x000C) (ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
	struct FString                                     ItemSource;                                                // 0x002C(0x000C) (ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                       ItemGuid;                                                  // 0x0038(0x0010) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                               bInOverflow;                                               // 0x0048(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
