#pragma once

// Name: Fortnite, Version: OT-6_5


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
// 0x95D8 (FullSize[0x9A18] - InheritedSize[0x0440])
class UFortnite_M_Avg_Player_AnimBlueprint_C : public UFortPlayerAnimGraphInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0440(0x0004) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6AE6BE5E4245D9BDD885E88DC11CFDE2;       // 0x0444(0x0044)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_90346CA949B10612E2517A98EABCA3F2; // 0x0488(0x002C)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_80EBD977446C9F5DE2B4EF911D08E2DB;  // 0x04B4(0x008C)
	struct FAnimNode_Root                              AnimGraphNode_Root_3FC5D63748E5DFF6573A82BF5641E6BB;       // 0x0540(0x002C)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_610F7B56472AA73B1B2D9281CAFE23DF;  // 0x056C(0x008C)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_0835E37E4BE8CE8DD6C449A998E91383; // 0x05F8(0x0098)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_C2FBA628431D909430E0B383682A0D68;       // 0x0690(0x0044)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_8B17DAC94A8C00B10BE1CCB9FAFE89F2; // 0x06D4(0x0040)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_DF9058564507FBE1DAB7BAADDC8AC490; // 0x0714(0x0040)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_CCBF1E684B4742313BC6CD97062B3F3D;       // 0x0754(0x0044)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9F47DEB24F88BB6E2748CF9F93B4F77F; // 0x0798(0x005C)
	struct FAnimNode_HandIKRetargeting                 AnimGraphNode_HandIKRetargeting_569D26DB417B57D435C3B3A6D2DB399A; // 0x07F4(0x0088)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03A99EBE40BEF26D9F77C8B679A9DA44; // 0x087C(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF6808CB43DA4D499C3A5DBF1A56C72A; // 0x08A8(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F3233B634924C6EDFAADC3B8858E495A; // 0x08D4(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9A8FAB6471BE9BB2065CCAD68BFD3A1; // 0x0900(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7B9D981343EA9D6D2C2280B5AB2D2DAA; // 0x092C(0x002C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A1FB4F074BB4541FC781B685940BFB6D; // 0x0958(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_91EE493C4141FC70DBD98AA5C99881E9; // 0x09B0(0x002C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0F696B4C48FDC756C1307F8830F333BB; // 0x09DC(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_9B995FFD476A23CD14834588D3431F18; // 0x0A34(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4016C8634395E7DBE6DADFACE1437074; // 0x0ACC(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_00A6D9564270F139728143BA9A944B55; // 0x0B24(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_E901301048D2052565769F868D3CCC87; // 0x0B7C(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7E1472E843281455E569E2AB9E86DF4D; // 0x0C14(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C0B22DB34A1918D8969FA6B265699004; // 0x0C6C(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_43CB690447A8B3786B0A69BBCCDE73B4; // 0x0D04(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB44F81243B72B883AF99F8559843493; // 0x0D5C(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3452C97B4D4BA6A4DCBF8AB44F390850; // 0x0DB4(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F4BE42DD4B9851B3C9AF4EA613292CC8; // 0x0E4C(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CF2E2DB4AF8B18F83840682312D9A80; // 0x0EA4(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_844815024A9E28640FB24BA988FA241C; // 0x0EFC(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9E6760DA47A7929715E5F39D06D06CCE; // 0x0F94(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_64058D914058A84E1F50E0B81F6EB632; // 0x0FEC(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3FCC4AA746864A4545D71C9C91D14308; // 0x1084(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_A1A32809447AEEB2C48F82BDCFF592CD; // 0x10DC(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CD1A14E84D394074385774A966C69F40; // 0x1174(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5B2F2FD0424DC73DCBB460A168861D31; // 0x11CC(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6C47FAD447E1FC96EBA79090801AF07E; // 0x1264(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01061BB04A1779A229EB849CF83ED818; // 0x12BC(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0982DA644B966DCEECB02D9AB47854A3; // 0x1314(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_779867804C7E2F55840E16B2F79130E3; // 0x136C(0x0058)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_986753D8463F3B44702BF98C22318132; // 0x13C4(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_28891C784C343848B0F98CA64D23E878; // 0x140C(0x00DC)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A118BB11458032422A5BC8A1E89C0ADD; // 0x14E8(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E14E8394440C5F586C565494EAE17D53; // 0x1540(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F782A15C4E3C5D911BA130A93F7D4FC1; // 0x1598(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_53E6FF0B4CE05596F82A6F8FA0F7588A; // 0x15F0(0x0098)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_8DE9A0DC4FBEF5490219FAA4EACD925B; // 0x1688(0x0040)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0EFBB5D041262FB97BB376B5FE628FA3; // 0x16C8(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_068AA4FA459FAF7D6BF38AA9CB6A959B; // 0x16F4(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCE4909D469B6481C5C6328FE6F312EB; // 0x1720(0x002C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B143762B4AD1CC9427E33287837B8727; // 0x174C(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_960969B64351C51FE9728D8DE415D59E; // 0x17A4(0x002C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5E2FD5044C5985CAB40E91B7F9A4D2D7; // 0x17D0(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_64B6A1CA4B728650D57868A399A59270; // 0x18AC(0x0098)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_13571E064835EC784E7D009410A9955C; // 0x1944(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6D9CEF1545C28FFCB8313E85B2EB0794; // 0x1984(0x008C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_75276A384C4C3DE35880118DF8DCC06C; // 0x1A10(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_04A100C04D68E5E6190E39A9EC99110A; // 0x1AEC(0x00DC)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5DA815AC40CC356D32A9188DC16931DF; // 0x1BC8(0x002C)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9840A3B349F2C4513E16BC8F99F31F2A; // 0x1BF4(0x0094)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_56AEB2CE49605B5F061E9784765259C3; // 0x1C88(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C123981043E5D6DF76E6CFB301351418; // 0x1CB4(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B970985B47A107603746EFA2C0EE72F5; // 0x1CE0(0x002C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6CB772BE4A9A67CF7F405EAF16A32C8B; // 0x1D0C(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BF31ED834067DCB09EB52398D06F1E99; // 0x1D64(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A3B76DA84DAA22FDE52DDC97EF29C928; // 0x1DBC(0x008C)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FA04DD0544E75B1EADBE65ACB75C95B12; // 0x1E48(0x002C)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_E0B6E1E748E9F3D19ACE3FBA28EE25DB; // 0x1E74(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D6E69F444A0E06316456E1B628C6CA4D; // 0x1F0C(0x008C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E4B0F91D4405E4A50C668384B7A03983; // 0x1F98(0x00DC)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9C6F4DD8418EAF773436B6B62A95CDCF; // 0x2074(0x008C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_892F2D9942F812747338029AA2996835; // 0x2100(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F3C7F4124F4ADC62C46ABF9292FFEE56; // 0x21DC(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_9F5B063742F43F57E4775EB633A2BE59; // 0x22B8(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_012B457A49C835824BD7A298C4797199; // 0x2350(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9FDCEBE641DC7397DE3724899D19727B; // 0x242C(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_887FD21947DD1E8C5F0A20B474B96645; // 0x2508(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FA65FDE04322C7073130D692686C0EA1; // 0x25E4(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_32896D0241982E8261A1E380D4E0254F; // 0x26C0(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D2FFA2C64E403D1B8AB5C197298D3EE0; // 0x2758(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1FE69E724D0F9EEA3DF6688273F126C8; // 0x2834(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D7BA0312427835D4BA96608F62A7B382; // 0x2910(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9897721D4F06AA4B3EBA4B85730B3671; // 0x29A8(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9C62AA05470DF1AA735E15AA85763883; // 0x2A84(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_79F5CCF640AC2A28D8BBB5B7B330E937; // 0x2B60(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F67F8EB84E72D4B13AA3698251D3CE44; // 0x2BF8(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0F5AC8F6407C4D3100DF9DBD7BAF564A; // 0x2CD4(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_816F99164AED195EB6F597BA3EFD1E77; // 0x2DB0(0x00DC)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2A3D0C984F2D48BBADFC74AF9FA623CC; // 0x2E8C(0x008C)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_62297F874465E32162CED9906ED48E13; // 0x2F18(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FE06921040D1E0E95237EE9892324406; // 0x2FB0(0x008C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9B5E395643BC7CCAD06E27978191C492; // 0x303C(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_927498FD443AABAA5599D5A9A3755F95; // 0x3118(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_180D05B24153261751ADAB940AFDFBFD; // 0x31F4(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3849C1F24B7C447B50C791981C513924; // 0x32D0(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8833E2484553180D15E034B8BE0954A9; // 0x33AC(0x00DC)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_86DEEE5845862F8183E83CBC0DA96FB5; // 0x3488(0x008C)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F9525FA9436CED0BEB7CCB962FE20D14; // 0x3514(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_582A5AD64FD3EB3B2F0AA49F8E584082; // 0x35AC(0x008C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A4AEE4DB4B9965C6FA522E92E912E767; // 0x3638(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_75D937654F72D1D8C62A679F49AB33DB; // 0x3714(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_21B70E4945035B0D26F76EAE1E6792D9; // 0x37F0(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_97EA913B4A5972FF70CB42A978F502EE; // 0x38CC(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BC07095A415DC70727040ABD25065DE2; // 0x3964(0x008C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8E2A411044E29E1F9011EDB01EF59799; // 0x39F0(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6FDFF9834C62BD875BC13DB4B35DFC30; // 0x3ACC(0x0098)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1557FD4E4B083C42E42BB095333CCECB; // 0x3B64(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A96478E24B96D55205181A8575BFB378; // 0x3BFC(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2314C6DE491D27820D3D259D681A2CF5; // 0x3CD8(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_304CB85E408551EF24CE508E1237FF2F; // 0x3DB4(0x0098)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_879D53B647D728D3BC628F90D18E1583; // 0x3E4C(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_56F3AF044AF6AD89CB42AA98EEE4F8A3; // 0x3EE4(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_29223B9F4B1864DD40E4F78869D5F1D0; // 0x3FC0(0x00DC)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D193204F4E6B3201AF6D019E6359C2E6; // 0x409C(0x008C)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D8C534004150C2D1CCCE71A8BD31540B; // 0x4128(0x008C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FFFD20C54810564C69F4CDAACF343718; // 0x41B4(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D6F53E5242269E6B3FEC69BBDD14151A; // 0x4290(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0BAAE35145A29A1F0EE5ABA8B7C128B6; // 0x436C(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_552813614F7A8A51C3A187ABA2DC5887; // 0x4448(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8B05BEF54E3CCC18634998AEE9718D5C; // 0x44E0(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C8CB947A4E2E7B7A2E9E028F6D8D4FB4; // 0x45BC(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5C9DE4DF4442F3B0AD19B798CF901677; // 0x4654(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0F5C818B45BA6D90642F4A8129DA4748; // 0x4730(0x00DC)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B4FAD52F46F24B305414D3AA806A4154; // 0x480C(0x008C)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_972B68654BC9A542A4D6258A644774DE; // 0x4898(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2E2E41E9464DF126B316038F56FEA342; // 0x4930(0x008C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_ACFF1FCA403DB5957BB20C8A68737292; // 0x49BC(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1D529C574AB00EF5FECA83836DFE7B82; // 0x4A98(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6A7AFE034995DC9489B318A9B259C7A1; // 0x4B74(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_177E8BEF4456027287F269BCAB266C74; // 0x4C50(0x00DC)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FDEA3722454C4348056AB49E57E28CAF; // 0x4D2C(0x008C)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2EEC215A4FEDE3B14CC9F5A7DB49ABF8; // 0x4DB8(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C539F7D3421D40B1732A3EA515DD681E; // 0x4E94(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1B61679C45551D7523E7B6BF0AEAC7E4; // 0x4F70(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A0809BC94FBE4C2BD0CAECBBB630790C; // 0x5008(0x00DC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_25B60D53461397AE056B64B509ABFD31; // 0x50E4(0x0098)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_31FA993E4BA1E6398E2A7B998E3072F4; // 0x517C(0x00DC)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9CD275AE4A6CDC9F8CADE9BB8678AB9A; // 0x5258(0x00DC)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_974868C5458AF4DCBD8F288104DA7BBC; // 0x5334(0x008C)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_6A0D564A45BD44C65EDC9BB51A930DA1; // 0x53C0(0x0024)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_88D27E23408F59EA5089568525BBA1B7; // 0x53E4(0x008C)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5B2D35834AE62DDE159132B8FDBD20FF; // 0x5470(0x002C)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_783ABF7C4CA018D018B5DB946E2D57FB; // 0x549C(0x0094)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_26D589EF4474329DF75C2C87B3EED561; // 0x5530(0x002C)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_429DAA0E44D3514478950EBFC19411F7; // 0x555C(0x0044)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C1E48E434EB0E4461F3A4BBCEA8218D5; // 0x55A0(0x002C)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_A15AA658449A2A1ADA81C29D4B028CEC; // 0x55CC(0x0040)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_EF64CF1D49BF4446C01B5E8E7F3A1799; // 0x560C(0x006C)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BA72E5A0455FDBCDB43EB8BED5582C13; // 0x5678(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_88BCD8124A58678127FF55B84FAFA8D1; // 0x56C0(0x002C)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5916E57B4B64B5ADAED53F9461C33322; // 0x56EC(0x0094)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CF06AFB242DADBDB5C4345AA6825CCFF; // 0x5780(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E84CA6CE4DB27FC4F7490B8CB12B2696; // 0x57D8(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C6E1544B4D5C43B80E7D29BD1631F572; // 0x5830(0x0058)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_0438E21E4962623DABFF6086B806FBC7; // 0x5888(0x00EC)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_085E06714429E275B88C1E9617B40F04; // 0x5974(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5079E5F440D312C57586CBB85AD6A582; // 0x59CC(0x008C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_909B9AC3489987BF10C5819BD9BA9AB1; // 0x5A58(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CDDA41064836D2CA50087FA8CD8A2417; // 0x5AB0(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_49D75D744ACC71488DA0D7B59C8EEC38; // 0x5B08(0x008C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19ACE15842978BEA66DC40BB01264BD9; // 0x5B94(0x0058)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_0F9BB84844A70A1AF5D87FA9701326ED; // 0x5BEC(0x00EC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_47794349405211F9D824DABD2BD8A9C3; // 0x5CD8(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6F60C26D4460E3723A0C93B7C24AF67E; // 0x5D70(0x008C)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_F226737A4B8D450EA5AB38A7D93AE757; // 0x5DFC(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_F91CB0444C9531C68908B3B5B65B3565; // 0x5EE8(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_EA8961E04BEB09111624FEBD9FB9C492; // 0x5FD4(0x00EC)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_814DFCE044277A180D7F93B35AB3AFD9; // 0x60C0(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7D7B677442167E70656BE1A2531941CA; // 0x6118(0x008C)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_31819DC545C85E42BFE57A80EF1EEFC0; // 0x61A4(0x00EC)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0DCB97EB4ED5DE70DF6D8288A762A79A; // 0x6290(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4A8B63714945178AB2EAEE9080937872; // 0x62E8(0x0058)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3DEB50D3453475EA2AA16593DD6A1849; // 0x6340(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BC27D4904A81766CF5A2EBAD41F6942A; // 0x63C0(0x008C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_04A71FC847BC73584B03E8ABC0CEE100; // 0x644C(0x0058)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_7C31A53D48F3159ED1D7759E8425F3D8; // 0x64A4(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_3CE4CC47459312E773702B8D3DB4F0D5; // 0x6590(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_0FF4E5DF45638DF2F9B990A3DBF0BC15; // 0x667C(0x00EC)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_490BB5B743EBAC771E3B2C800EAADB3C; // 0x6768(0x008C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1325B2594B09DD8141C01D9274A0D04F; // 0x67F4(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_67717579495D7A9FA6CFC483DD706300; // 0x684C(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_998621D74CA72EE3EACA10A088A74B79; // 0x68A4(0x0058)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8CA11A0148AD3599C8C5A68936D186B1;       // 0x68FC(0x0044)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_610F274F4E3B9C4346C6949A50567B71; // 0x6940(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A2BBF3A4A1B2DC539D5A991C68D6E19; // 0x696C(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F7814814B371A3DF4B359BD88AF3E70; // 0x6998(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FCC890AA4710698C891A5485E1E3ABCC; // 0x69C4(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8DD3B2C84A372E66CD0782938E22672D; // 0x69F0(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_200BE71F42E88EFFBAE17EAF152CEA7D; // 0x6A1C(0x002C)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B511E5D43329E71F4917D95F739CA65; // 0x6A48(0x002C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41CB25E04998A26FCEF3F2904648CD81; // 0x6A74(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_59944AB44BA8923A2A0CAB8CBE821C49; // 0x6ACC(0x002C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_545420C64B78A4F59A83A69C96107A9C; // 0x6AF8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_32D322B345CDD0FCBF52988CA10E290E; // 0x6B50(0x002C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C4A67D774C6CB4EBDBDF6E8192CBC50A; // 0x6B7C(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99A1E4B54248F04F4687D69B954A5EC3; // 0x6BD4(0x002C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4C747D1340D3D1FCD000D2AAF4873090; // 0x6C00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8F9F075C4C918632AFEEBD8662D1901A; // 0x6C58(0x002C)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_30BBA76747B35A4791A1DAB2B66D8A07; // 0x6C84(0x0024)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FA04DD0544E75B1EADBE65ACB75C95B1; // 0x6CA8(0x002C)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3E22F765444994C1A890CAAAED910991; // 0x6CD4(0x0094)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_8C4B3BC145DB6F2FD7780FACF676D0CF; // 0x6D68(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_84157BE948059A843EA0A6B1C3EF095E; // 0x6DB0(0x00DC)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DD77219B432B97B3584255862E88741C; // 0x6E8C(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_79D30C9B4BB82811599BFDAE6F9574FB; // 0x6ED4(0x002C)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C44FD2E84741D72277EAC8B90F118A2B; // 0x6F00(0x002C)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_E02BD6CF40877D64E7345298615DDA3B; // 0x6F2C(0x00EC)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5E9CB9364E97BCEC4BC16384CBD097AB; // 0x7018(0x0058)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_36A8801645C3D4DDEC3BA6847D55A02D; // 0x7070(0x002C)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_4A35C2A0428B3EE54093E9A54FAE32BC; // 0x709C(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A5E3B7354C42F9AF07982BBA40423E2B; // 0x7134(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_BC41F1A243E6635D5FF0E3BD18F47A27; // 0x718C(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_69AABED142D7FD175AF052B6F2AA259A; // 0x7224(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_B0ED40F841CC110B5ADE8C84AC4284A2; // 0x727C(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4CE38D494A8165387DC327B3BEE0E208; // 0x7314(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_768957C946717B581932F5A62B669751; // 0x736C(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_793346EB4AAFE5E7125CDC9B811535AB; // 0x7404(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_2D586ED14D7CBE5B58E3EE9710710AC1; // 0x745C(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_44106FE048C94AA536732F8EA9A279FC; // 0x74F4(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7DDD91E243427AFD0C632885552D8D91; // 0x754C(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC2DAE784CA4086F744C95A3A0A7DD94; // 0x75E4(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_8B0DD80442041A8D2C4485B7A124449A; // 0x763C(0x0098)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_27D15A4B4F0C860A9927DC869B647AED; // 0x76D4(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ED24416742B58415617D18ADDBC8193C; // 0x776C(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_8A5018064F04700BF102AC948E3B245A; // 0x77C4(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8BB97FF34B6B5488ADB15B8E7A207DB8; // 0x785C(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7D827794450B034AEBF776A11588C175; // 0x78B4(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_2DEA8F35448D7CAF84D8BFBE2482094B; // 0x790C(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A0C2AEE4467ED5FCA705BFA4ECA4BC81; // 0x79A4(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_000BB1C2444F957ABE8AE5BDD08D1399; // 0x79FC(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_232FE0AA4393EC9067CA1FA8DE648949; // 0x7A54(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F2762FE34606B8DF9D465C830F2DDC5D; // 0x7AEC(0x008C)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_55A07775424CF50430BBE790A5293F01; // 0x7B78(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_C4CD606D4DEEFCCFE498EF89D57AF494; // 0x7C64(0x00EC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_9F645DAE480CD771C0847996550C7DB6; // 0x7D50(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A951B1324BD5412B90BBB3AA6B155190; // 0x7DE8(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A8C311E4FDA2EB4426B079B53D2FB1A; // 0x7E40(0x0058)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_C4E38A6944120DFB16E70C979940E621; // 0x7E98(0x00EC)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DF448DFA4AA18FDE514F4BA93319CBFA; // 0x7F84(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E7A870FE4517568A8A32D48CF38AEAE7; // 0x7FDC(0x008C)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3B00D39742944DB0B6AB9EBCB4D40557; // 0x8068(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3923A4B94736B0A91A585DA3C2EBBC7C; // 0x8100(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_0ECC98044E437714CFD1808F48FCFADB; // 0x8158(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4E1763E1479F6D7B97B8C0AF73E3AFB7; // 0x81F0(0x008C)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_EB6A46A6444AA6C5965103B3BBD2DDCF; // 0x827C(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_950CD3B14A6AD11D8F7AA8BC8A1F4CB4; // 0x8368(0x00EC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6F9A45FD4F0D32D0F26173B87988ED0F; // 0x8454(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4401AD44438A5F9457E767B1E601CB98; // 0x84EC(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6514CF9D4C259FE0E1F2A9AA2833CC33; // 0x8544(0x0058)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_E8490AF541C5A2E162C78190FBFE7363; // 0x859C(0x00EC)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C7E4912B445D6D3D6651B494853DE1BD; // 0x8688(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E02F81B84D0561BC62F3F9867946EA61; // 0x86E0(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6DDE2EF0443E2F6833096EAB865A5B05; // 0x8738(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F6C1356A4252A11C25B3D78A2609D7AB; // 0x87D0(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F6CEE6BD4CCC81C772B08787423C90FE; // 0x8828(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F51E07A74B6174B2EAE582B9C51A61F2; // 0x88C0(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3060E33B4F595E499BAF838E5D1BEE81; // 0x8918(0x008C)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_486018984BAC2FF16A804A9829DA0DE6; // 0x89A4(0x008C)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_827CFDE94796918DCC9201B0B0DB1746; // 0x8A30(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_2CE973794388A7BC036869979B28EBAA; // 0x8B1C(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_9C71E1D44B922146B88C44B908522180; // 0x8C08(0x00EC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_CE7CC6B84958677B16D2B7A79AD6E81B; // 0x8CF4(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A6B5E0E04D31AF222A3B6DA3BA93F112; // 0x8D8C(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_837272714A8943AAF6075BB8C52CF4C9; // 0x8DE4(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13B05B014BDC3D6A4690DE81A98ABE7B; // 0x8E7C(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F0798FAD4CAC13511BAF449542E326AB; // 0x8ED4(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A9D3D88497C59354759078CA1DC53AE; // 0x8F6C(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F3D8D234BBB08BD5C430E9EFD89CE2A; // 0x8FC4(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6C175CD94A0DF5FF6B6E49B90D6F1C4C; // 0x901C(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_07A4B07D4B4CE2C9C34D9AA63F603992; // 0x9074(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6FFB3C484AA26EB6D08AA9B058729126; // 0x90CC(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_08E45AAC48A94487CB9D108FFCC4EE62; // 0x9124(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CF4C21B14B5C5C91C5F925AB0B3B9A2F; // 0x91BC(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_290F8A7E4F5A8A4F7A0A6EB7ADC74B1E; // 0x9214(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_91A59EAA4E788F0FD69B9D9EF16755BE; // 0x926C(0x008C)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_85FA0C4143DC48DD484234BE558DCC9B; // 0x92F8(0x008C)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EAE0595541B145301F7B3794203E0323; // 0x9384(0x0058)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_2B6C75424B487FCBEAD234BE27CEDCD2; // 0x93DC(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_DC76AEEE4C2E5F29C097CFAC833873BD; // 0x94C8(0x00EC)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_737A5BB84BC1E3B1CD2374B0078327B2; // 0x95B4(0x00EC)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_87B2A6FD40B15B416C91DCAF6C4F8356; // 0x96A0(0x0098)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F0FD5DAA4F3D4B7A0A9031A363CEA67C; // 0x9738(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A974AC844331F50E7BDE48BA0EEC581; // 0x97D0(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_4CA4F6F941428D8E504E73BE7963934E; // 0x9828(0x0098)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C7467CE047ED920DE2DF99ABEBC61CF9; // 0x98C0(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_901242104DF36617800D38AD5B327841; // 0x9918(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6C72D00149A6A36E45B6DAACE432044C; // 0x9970(0x0058)
	TEnumAsByte<FortniteGame_EFortCustomBodyType>      BodyType;                                                  // 0x99C8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TEnumAsByte<FortniteGame_EFortCustomGender>        Gender;                                                    // 0x99C9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TEnumAsByte<FortniteGame_EFortBuildingState>       BuildingState;                                             // 0x99CA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TEnumAsByte<FortniteGame_EFortWeaponCoreAnimation> WeaponCoreAnim;                                            // 0x99CB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              Speed2D;                                                   // 0x99CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              VelocityZ;                                                 // 0x99D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              MovementDirectionYawAngle;                                 // 0x99D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bIsSprinting;                                              // 0x99D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_N4JP[0x3];                                     // 0x99D9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              SprintLeanAdditiveAngle;                                   // 0x99DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bIsTargeting;                                              // 0x99E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_B83H[0x3];                                     // 0x99E1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              SprintYawAngle;                                            // 0x99E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bPlayingRootMotion;                                        // 0x99E8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_8CW9[0x3];                                     // 0x99E9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              TargetingWeight;                                           // 0x99EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bEnableHandIK;                                             // 0x99F0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bMoveIKGunToHandFK;                                        // 0x99F1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_C3JU[0x2];                                     // 0x99F2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Hand_IK_to_FK_LR_Weight;                                   // 0x99F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bIsStunned;                                                // 0x99F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bEnableAdditiveLayer;                                      // 0x99F9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bDisableLowerBody;                                         // 0x99FA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_GEG7[0x1];                                     // 0x99FB(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              DeltaSeconds;                                              // 0x99FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bLockBodyType;                                             // 0x9A00(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_7VYB[0x3];                                     // 0x9A01(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              MeleeJumpWeight;                                           // 0x9A04(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bTestNewJump;                                              // 0x9A08(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_PVOZ[0x3];                                     // 0x9A09(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              FallPlayRate;                                              // 0x9A0C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              FallAnimPlayTime;                                          // 0x9A10(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              SprintSpeedThreshold;                                      // 0x9A14(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint_AnimGraphNode_TwoBoneIK_80EBD977446C9F5DE2B4EF911D08E2DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint_AnimGraphNode_TwoBoneIK_610F7B56472AA73B1B2D9281CAFE23DF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint_AnimGraphNode_RotateRootBone_8B17DAC94A8C00B10BE1CCB9FAFE89F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint_AnimGraphNode_RotateRootBone_DF9058564507FBE1DAB7BAADDC8AC490();
